joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
// ARQUIVO UNICO gerado por sync_arduino_sketch.sh - copie/cole inteiro na Arduino IDE.
// Sketch Arduino IDE para ESP32-S3 (equivalente ao env "esp32s3" do platformio.ini).
//
// Placa: ESP32S3 Dev Module
//   Flash Size: 16MB (128Mb)
//   Partition Scheme: 16M Flash (3MB APP/9.9MB FATFS)  (ou "Custom" com partitions.csv desta pasta)
//   PSRAM: OPI PSRAM (ou Disabled, conforme o módulo)
//   USB CDC On Boot: Enabled (se gravar/monitorar pela USB nativa)
//   Upload Speed: 921600
//
// Bibliotecas (Gerenciador de Bibliotecas):
//   WiFiManager (tzapu) >= 2.0.17
//   ArduinoJson (Benoit Blanchon) 6.x
//   PubSubClient (Nick O'Leary) >= 2.8
//
// O código-fonte fica em firmware.h (cópia de ../../esp32_bluetooth_chair/src/main.cpp).
// Para sincronizar após editar o main.cpp: execute ../sync_arduino_sketch.sh

// 1 = testes de bancada: sem BLE/WiFi/MQTT/Supabase/OTA (comandos pelo Monitor Serial). 0 = firmware completo.
#define OFFLINE_MODE 1

#define I2C_EARLY_TEST 0
#define I2C_SDA 2
#define I2C_SCL 18
#define I2C_CLOCK_HZ 100000
#define PCF8574_INT_PIN 1
#define PIN_RF 15
#define PIN_SA 14
#define PIN_GAVETA 20
#define PIN_TREN_INT_DESCE 3
#define PIN_INT_TREND_DESCE 8
#define PORTS_ONLY 0
#define PORTS_VERIFY 0
#define TEST_MODE 0
#define PIN_ENCODER1 4
#define PIN_ENCODER2 17
#define PIN_ENCODER3 19
#define PIN_RELE_SA 16
#define PIN_RELE_DA 9
#define PIN_RELE_SE 5
#define PIN_RELE_DE 6
#define PIN_RELE_SP 7
#define PIN_RELE_DP 10
#define RELE_DP_ACTIVE_LOW 0
#define PIN_RELE_REFLETOR 11
#define PIN_RELE_TREND_DESCE 48
#define PIN_RELE_TREND_SOBE 47
#define PIN_LED 12
#define PIN_BUZZER 13


// ===================== firmware (ESP32/esp32_bluetooth_chair/src/main.cpp) =====================
/*
  ========================================================
  CADEIRA ODONTOLÃ“GICA - ESP32
  Com Bluetooth Serial + WiFiManager + Supabase
  ========================================================
  
  Funcionalidades:
  - Controle via Bluetooth Serial (SPP)
  - ConfiguraÃ§Ã£o WiFi via portal captivo (WiFiManager)
  - IntegraÃ§Ã£o com Supabase para telemetria
  - HorÃ­metro para rastreamento de uso
  - Bloqueio remoto da cadeira
  - Sistema de encoder virtual para posicionamento
*/

#include <Arduino.h>
#include <Preferences.h>
#include <WiFi.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <Update.h>
#include <ArduinoJson.h>
#include <PubSubClient.h>
#include <Wire.h>
#include <new>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/queue.h>
#include <esp_idf_version.h>
#include <esp_task_wdt.h>

// OFFLINE_MODE=1: desliga BLE, WiFi, MQTT, Supabase, NTP e OTA; so botoes/reles/encoders + comandos via Serial.
#ifndef OFFLINE_MODE
#define OFFLINE_MODE 0
#endif

#if OFFLINE_MODE
#define HAS_BLE 0
#else
#define HAS_BLE 1
#endif

#if HAS_BLE
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#endif

#ifndef USE_PCF8574
#define USE_PCF8574 1
#endif

static const int IO_PCF_BASE = 100;

#ifndef PCF8574_ADDRESS
#define PCF8574_ADDRESS 0x20
#endif

#ifndef PCF8574_INT_PIN
#define PCF8574_INT_PIN 1
#endif

#ifndef PIN_SA
#define PIN_SA 14
#endif

#ifndef PIN_RF
#define PIN_RF 15
#endif

#ifndef PIN_GAVETA
#define PIN_GAVETA 20
#endif

#ifndef PIN_TREN_INT_DESCE
#define PIN_TREN_INT_DESCE 3
#endif

#ifndef PIN_INT_TREND_DESCE
#define PIN_INT_TREND_DESCE 8
#endif

#ifndef PIN_TREN_INT_SOBE
#define PIN_TREN_INT_SOBE -1
#endif

#ifndef PIN_INT_TREND_SOBE
#define PIN_INT_TREND_SOBE -1
#endif

#ifndef PIN_ENCODER1
#define PIN_ENCODER1 4
#endif

#ifndef PIN_ENCODER2
#define PIN_ENCODER2 17
#endif

#ifndef PIN_ENCODER3
#define PIN_ENCODER3 19
#endif

#ifndef PIN_ENCODER_TREND
#define PIN_ENCODER_TREND 46
#endif

#ifndef I2C_SDA
#define I2C_SDA 2
#endif

#ifndef I2C_SCL
#define I2C_SCL 18
#endif

#ifndef I2C_EARLY_TEST
#define I2C_EARLY_TEST 0
#endif

#ifndef I2C_CLOCK_HZ
#define I2C_CLOCK_HZ 100000
#endif

#ifndef PORTS_ONLY
#define PORTS_ONLY 0
#endif

#ifndef PORTS_VERIFY
#define PORTS_VERIFY 0
#endif

#ifndef TEST_MODE
#define TEST_MODE 0
#endif

#ifndef FIRMWARE_VERSION
#define FIRMWARE_VERSION "0.0.0"
#endif

static bool i2cPing(uint8_t address) {
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

static String i2cScanSummary() {
  String out;
  for (uint8_t address = 0x03; address <= 0x77; address++) {
    if (i2cPing(address)) {
      if (out.length() > 0) out += ",";
      char buf[6];
      snprintf(buf, sizeof(buf), "0x%02X", address);
      out += buf;
    }
  }
  if (out.length() == 0) return "NONE";
  return out;
}

static bool i2cReady = false;
static bool pcf8574Available = false;

static bool pcf8574WriteByte(uint8_t address, uint8_t value) {
  if (!i2cReady) {
    return false;
  }
  if (!pcf8574Available) {
    pcf8574Available = i2cPing(address);
    if (!pcf8574Available) {
      return false;
    }
  }
  Wire.beginTransmission(address);
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

static uint8_t pcf8574ReadByte(uint8_t address, bool* ok) {
  if (!i2cReady) {
    if (ok) *ok = false;
    return 0xFF;
  }
  if (!pcf8574Available) {
    pcf8574Available = i2cPing(address);
    if (!pcf8574Available) {
      if (ok) *ok = false;
      return 0xFF;
    }
  }
  int n = Wire.requestFrom(static_cast<int>(address), 1);
  if (n < 1 || Wire.available() < 1) {
    n = Wire.requestFrom(static_cast<int>(address), 1);
    if (n < 1 || Wire.available() < 1) {
      if (ok) *ok = false;
      return 0xFF;
    }
  }
  if (ok) *ok = true;
  return static_cast<uint8_t>(Wire.read());
}

void executaComandoBluetooth(String cmd, const char* origin);
static void inicializaEstadosDeBordaBotoes();
extern bool lastButtonState_GAVETA;

static void processaComandosSerialDebug() {
  static String serialCmd;
  while (Serial.available() > 0) {
    char c = static_cast<char>(Serial.read());
    if (c == '\n' || c == '\r') {
      if (serialCmd.length() > 0) {
        String cmd = serialCmd;
        serialCmd = "";
        cmd.trim();
        executaComandoBluetooth(cmd, "SERIAL");
      }
      continue;
    }
    if (serialCmd.length() < 64) {
      serialCmd += c;
    }
  }
}

static inline int PCF_PIN(uint8_t pin) {
  return IO_PCF_BASE + pin;
}

#if USE_PCF8574
static volatile bool pcf8574InterruptPending = false;
static volatile uint32_t pcf8574InterruptCount = 0;
static uint8_t pcf8574CachedIn = 0xFF;
static uint32_t pcf8574CachedAtMs = 0;
static uint8_t pcf8574Out = 0xFF;
static uint8_t pcf8574LastIn = 0xFF;
static bool pcf8574UseInterrupt = false;

