joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
static void IRAM_ATTR IO_onPcf8574Interrupt() {
  pcf8574InterruptPending = true;
  pcf8574InterruptCount++;
}

static const char* pcf8574PinLabel(uint8_t p) {
  switch (p) {
    case 0: return "M1";
    case 1: return "SE";
    case 2: return "PT";
    case 3: return "VZ";
    case 4: return "DP";
    case 5: return "SP";
    case 6: return "DE";
    case 7: return "DA";
    default: return "?";
  }
}

static void pcf8574PrintStatus(uint8_t in) {
  Serial.println("--- STATUS DOS BOTOES PCF8574 ---");
  Serial.print("M1: "); Serial.print((in & (1U << 0)) ? "1" : "0");
  Serial.print(" | SE: "); Serial.print((in & (1U << 1)) ? "1" : "0");
  Serial.print(" | PT: "); Serial.print((in & (1U << 2)) ? "1" : "0");
  Serial.print(" | VZ: "); Serial.println((in & (1U << 3)) ? "1" : "0");
  
  Serial.print("DP: "); Serial.print((in & (1U << 4)) ? "1" : "0");
  Serial.print(" | SP: "); Serial.print((in & (1U << 5)) ? "1" : "0");
  Serial.print(" | DE: "); Serial.print((in & (1U << 6)) ? "1" : "0");
  Serial.print(" | DA: "); Serial.println((in & (1U << 7)) ? "1" : "0");
  Serial.println("--------------------------------");
}

static void pcf8574ReportChanges(uint8_t oldIn, uint8_t newIn) {
  uint8_t diff = static_cast<uint8_t>(oldIn ^ newIn);
  if (diff == 0) {
    return;
  }
  for (uint8_t p = 0; p < 8; p++) {
    if ((diff & (1U << p)) == 0) {
      continue;
    }
    Serial.print("[PCF8574_INT] P");
    Serial.print(p);
    Serial.print("(");
    Serial.print(pcf8574PinLabel(p));
    Serial.print(")=");
    Serial.println((newIn & (1U << p)) ? "1" : "0");
  }
  // Imprime a tabela completa quando houver mudanca (interrupcao)
  pcf8574PrintStatus(newIn);
}
#endif

static inline bool IO_isPcfPin(int pin) {
  return pin >= IO_PCF_BASE;
}

static void i2cRecoverBus(int sda, int scl) {
  Wire.end();
  pinMode(sda, INPUT_PULLUP);
  pinMode(scl, INPUT_PULLUP);
  int sda0 = digitalRead(sda);
  int scl0 = digitalRead(scl);
  Serial.print("[I2C] Recover start SDA=");
  Serial.print(sda0);
  Serial.print(" SCL=");
  Serial.println(scl0);

  if (scl0 == LOW) {
    Serial.println("[I2C] Recover abort: SCL travado em LOW");
    return;
  }

  pinMode(scl, OUTPUT_OPEN_DRAIN);
  digitalWrite(scl, HIGH);
  delayMicroseconds(5);

  for (int i = 0; i < 9; i++) {
    if (digitalRead(sda) == HIGH) {
      break;
    }
    digitalWrite(scl, LOW);
    delayMicroseconds(6);
    digitalWrite(scl, HIGH);
    delayMicroseconds(6);
  }

  pinMode(sda, OUTPUT_OPEN_DRAIN);
  digitalWrite(sda, LOW);
  delayMicroseconds(6);
  digitalWrite(scl, HIGH);
  delayMicroseconds(6);
  digitalWrite(sda, HIGH);
  delayMicroseconds(6);

  pinMode(sda, INPUT_PULLUP);
  pinMode(scl, INPUT_PULLUP);

  Serial.print("[I2C] Recover end SDA=");
  Serial.print(digitalRead(sda));
  Serial.print(" SCL=");
  Serial.println(digitalRead(scl));
}

static void IO_begin() {
  #if defined(I2C_SDA) && defined(I2C_SCL)
  if (I2C_SDA == 1 || I2C_SCL == 1) {
    Serial.println("[I2C] Erro: GPIO1 causa reset/crash nesta placa. Troque SDA/SCL.");
    i2cReady = false;
    pcf8574Available = false;
    return;
  }
  pinMode(I2C_SDA, INPUT_PULLUP);
  pinMode(I2C_SCL, INPUT_PULLUP);
  Serial.print("[I2C] SDA=");
  Serial.print(I2C_SDA);
  Serial.print(" SCL=");
  Serial.println(I2C_SCL);
  Serial.print("[I2C] SDA level=");
  Serial.print(digitalRead(I2C_SDA));
  Serial.print(" SCL level=");
  Serial.println(digitalRead(I2C_SCL));
  if (digitalRead(I2C_SDA) == LOW || digitalRead(I2C_SCL) == LOW) {
    i2cRecoverBus(I2C_SDA, I2C_SCL);
  }
  if (digitalRead(I2C_SCL) == LOW) {
    Serial.println("[I2C] SCL travado em LOW. Algum circuito esta puxando para GND (ou conflito de pino).");
    i2cReady = false;
    pcf8574Available = false;
    return;
  }
  if (digitalRead(I2C_SDA) == LOW) {
    Serial.println("[I2C] SDA travado em LOW. Algum circuito esta puxando para GND (ou conflito de pino).");
    i2cReady = false;
    pcf8574Available = false;
    return;
  }
  i2cReady = Wire.begin(I2C_SDA, I2C_SCL);
  #else
  i2cReady = Wire.begin();
  #endif
  if (!i2cReady) {
    Serial.println("[I2C] Wire.begin() falhou");
    pcf8574Available = false;
    return;
  }
  Wire.setClock(I2C_CLOCK_HZ);
#if USE_PCF8574
  pcf8574Available = false;
  for (int attempt = 0; attempt < 5; attempt++) {
    if (i2cPing(PCF8574_ADDRESS)) {
      pcf8574Available = true;
      break;
    }
    delay(10);
  }
  if (!pcf8574Available) {
    String scan = i2cScanSummary();
    bool foundByScan = scan.indexOf("0x20") >= 0;
    Serial.print("[I2C] PCF8574 nao respondeu em 0x");
    Serial.println(PCF8574_ADDRESS, HEX);
    Serial.print("[I2C] Scan: ");
    Serial.println(scan);
    if (!foundByScan) {
      return;
    }
    pcf8574Available = true;
  }
  pcf8574WriteByte(PCF8574_ADDRESS, pcf8574Out);
  bool ok = false;
  pcf8574CachedIn = pcf8574ReadByte(PCF8574_ADDRESS, &ok);
  pcf8574CachedAtMs = millis();
  pcf8574LastIn = pcf8574CachedIn;
  if (PCF8574_INT_PIN >= 0) {
    if (PCF8574_INT_PIN == 1) {
      Serial.println("[PCF8574_INT] GPIO1 instavel nesta placa. Usando polling (sem interrupcao).");
      pcf8574UseInterrupt = false;
    } else {
      int irq = digitalPinToInterrupt(static_cast<uint8_t>(PCF8574_INT_PIN));
      if (irq < 0) {
        Serial.println("[PCF8574_INT] Pino nao suporta interrupcao. Usando polling.");
        pcf8574UseInterrupt = false;
      } else {
        pinMode(static_cast<uint8_t>(PCF8574_INT_PIN), INPUT_PULLUP);
        attachInterrupt(irq, IO_onPcf8574Interrupt, FALLING);
        pcf8574UseInterrupt = true;
      }
    }
  } else {
    pcf8574UseInterrupt = false;
  }
#endif
}

static void IO_pinMode(int pin, uint8_t mode) {
#if USE_PCF8574
  if (pin < 0) {
    return;
  }
#endif
#if USE_PCF8574
  if (IO_isPcfPin(pin)) {
    if (!pcf8574Available) {
      return;
    }
    uint8_t p = static_cast<uint8_t>(pin - IO_PCF_BASE);
    if (p > 7) {
      return;
    }
    pcf8574Out |= (1U << p);
    pcf8574WriteByte(PCF8574_ADDRESS, pcf8574Out);
    return;
  }
#endif
  pinMode(static_cast<uint8_t>(pin), mode);
}

