joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
static void otaTick() {
  if (!otaEnabled || otaManifestUrl.length() == 0) {
    return;
  }
  if (otaInProgress) {
    return;
  }
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  uint32_t now = millis();
  if (otaNextCheckAtMs == 0) {
    otaNextCheckAtMs = now + 30000;
    return;
  }
  if (now < otaNextCheckAtMs) {
    return;
  }
  otaNextCheckAtMs = now + (otaIntervalSec * 1000UL);
  OtaInfo info;
  if (otaFetchManifest(info) && info.available) {
    otaDownloadAndUpdate(info);
  }
}

static bool mqttIsControlCommand(const String& cmdUpper) {
  return cmdUpper == "DE" || cmdUpper == "SE" || cmdUpper == "SA" || cmdUpper == "DA" ||
         cmdUpper == "SP" || cmdUpper == "DP" || cmdUpper == "TS" || cmdUpper == "TD" || cmdUpper == "TREND_TEST" || cmdUpper == "RF" || cmdUpper == "VZ" ||
         cmdUpper == "PT" || cmdUpper == "M1" || cmdUpper == "STOP" || cmdUpper == "AT_SEG" ||
         cmdUpper == "STATUS";
}

static void mqttPublishTxCmd(const String& cmdUpper, const char* origin) {
  if (!mqttClient.connected()) {
    return;
  }
  if (origin && String(origin) == "MQTT") {
    return;
  }
  if (cmdUpper.startsWith("MQTT_")) {
    return;
  }
  if (!mqttIsControlCommand(cmdUpper)) {
    return;
  }
  mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", cmdUpper, false);
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  Serial.print("[MQTT] Mensagem recebida no tópico: ");
  Serial.println(topic);
  
  String message = "";
  for (int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  mqttRxCount++;
  mqttLastRxMs = millis();
  Serial.print("[MQTT_RX] Payload: ");
  Serial.println(message);
  
  String cmd = message;
  cmd.trim();
  if (cmd.startsWith("CMD:")) {
    cmd = cmd.substring(4);
  }
  cmd.trim();
  cmd.toUpperCase();
  if (cmd.length() == 0) return;

  if (cmd == "STATUS") {
    publicaStatusMQTT();
    return;
  }

  if (mqttCommandQueue) {
    MqttCmdItem item;
    memset(&item, 0, sizeof(item));
    cmd.toCharArray(item.cmd, sizeof(item.cmd));
    xQueueSend(mqttCommandQueue, &item, 0);
  }
}

static void saveMqttPreferences();
static bool tlsHandshakeOnce(const String& host, uint16_t port);
static bool mqttRawConnackOnce(const String& host, uint16_t port, const String& clientId);

void reconnectMQTT() {
  if (!mqttClient.connected()) {
    static uint32_t mqttNextAttemptMs = 0;
    static uint8_t mqttNetFailStreak = 0;
    static uint8_t mqttTlsFailStreak = 0;
    uint32_t now = millis();
    if (static_cast<int32_t>(now - mqttNextAttemptMs) < 0) {
      return;
    }

    Serial.print("[MQTT] Tentando conectar...");
    
    String clientId = mqttClientId.length() > 0 ? mqttClientId : ("ESP32-" + NUMERO_SERIE_CADEIRA);
    String willTopic = MQTT_TOPIC_BASE + "lwt";

    bool locked = mqttLockMs(100);
    if (!locked) {
      Serial.println("falhou, mutex");
      mqttNextAttemptMs = now + 1000;
      return;
    }

    if (mqttUseTls) {
      resetMqttSecureClient();
      WiFiClientSecure& sc = mqttSecureClientRef();
      sc.stop();
      sc.setHandshakeTimeout(15);
      sc.setTimeout(20);
      sc.setInsecure();
      mqttClient.setClient(sc);
    } else {
      mqttClient.setClient(mqttPlainClient);
    }
    mqttClient.setSocketTimeout(5);
    mqttClient.setKeepAlive(30);
    mqttClient.setBufferSize(1024);

    mqttClient.setServer(mqttHost.c_str(), mqttPort);
    if (WiFi.status() == WL_CONNECTED) {
      IPAddress ip;
      if (WiFi.hostByName(mqttHost.c_str(), ip) == 1) {
        Serial.print("ip=");
        Serial.print(ip);
        Serial.print(" port=");
        Serial.print(mqttPort);
        Serial.print(" tls=");
        Serial.print(mqttUseTls ? "1" : "0");
        Serial.print(" clean=");
        Serial.println(mqttCleanSession ? "1" : "0");
      } else {
        Serial.print("dns_fail host=");
        Serial.print(mqttHost);
        Serial.print(" port=");
        Serial.print(mqttPort);
        Serial.print(" tls=");
        Serial.print(mqttUseTls ? "1" : "0");
        Serial.print(" clean=");
        Serial.println(mqttCleanSession ? "1" : "0");
      }
    }

    if (mqttUser.length() > 0 && mqttPass.length() == 0) {
      Serial.println("falhou, senha vazia (use MQTT_PASS=...)");
      mqttUnlock();
      mqttNextAttemptMs = now + 5000;
      return;
    }

    bool ok = false;
    if (mqttUser.length() == 0 && mqttPass.length() == 0) {
      ok = mqttClient.connect(
        clientId.c_str(),
        willTopic.c_str(),
        1,
        true,
        "offline"
      );
    } else if (mqttUser.length() > 0) {
      ok = mqttClient.connect(
        clientId.c_str(),
        mqttUser.c_str(),
        mqttPass.c_str(),
        willTopic.c_str(),
        1,
        true,
        "offline",
        mqttCleanSession
      );
    }
    if (ok) {
      Serial.println("conectado!");
      beepMqttErrorDone = false;
      mqttOkAtMs = millis();
      mqttLostAtMs = 0;
      mqttNetFailStreak = 0;
      mqttTlsFailStreak = 0;
      mqttPostConnectPending = true;
      mqttSubscribed = false;
      mqttPostConnectUntilMs = millis() + 5000;
      mqttUnlock();
      
    } else {
      Serial.print("falhou, rc=");
      int st = mqttClient.state();
      Serial.print(st);
      Serial.println(" tentando novamente em 5 segundos");
      mqttUnlock();
      if (mqttUseTls) {
        Serial.print("[MQTT_TLS] connect_fail port=");
        Serial.print(mqttPort);
        Serial.print(" fd=");
        Serial.println(mqttSecureClientPtr ? mqttSecureClientPtr->fd() : -1);
        char errBuf[160];
        memset(errBuf, 0, sizeof(errBuf));
        int errCode = mqttSecureClientPtr ? mqttSecureClientPtr->lastError(errBuf, sizeof(errBuf)) : 0;
        Serial.print("[MQTT_TLS] lastError=");
        Serial.print(errCode);
        Serial.print(" msg=");
        Serial.println(errBuf);
        static uint32_t mqttDiagNextMs = 0;
        if (static_cast<int32_t>(now - mqttDiagNextMs) >= 0) {
          mqttDiagNextMs = now + 30000;
          bool tlsOk = tlsHandshakeOnce(mqttHost, mqttPort);
          if (tlsOk) {
            String cid = mqttClientId.length() > 0 ? mqttClientId : ("ESP32-" + NUMERO_SERIE_CADEIRA);
            bool connackOk = mqttRawConnackOnce(mqttHost, mqttPort, cid);
            if (!connackOk) {
              Serial.println("[MQTT] Broker sem CONNACK no teste RAW");
            }
          }
        }
      }
      if (st == -2) {
        if (mqttNetFailStreak < 255) mqttNetFailStreak++;
        if (!mqttUseTls && mqttPort == 1883 && mqttNetFailStreak >= 1) {
          mqttUseTls = true;
          mqttPort = 8883;
          mqttTlsFailStreak = 0;
          Serial.println("[MQTT] Alternando para TLS (8883) por falha persistente em 1883");
          saveMqttPreferences();
          mqttNextAttemptMs = now + 1000;
          return;
        }
      } else {
        mqttNetFailStreak = 0;
      }
      if (mqttUseTls) {
        if (mqttTlsFailStreak < 255) mqttTlsFailStreak++;
        if (mqttTlsFailStreak >= 2) {
          mqttTlsFailStreak = 0;
          if (mqttPort != 8883) {
            mqttPort = 8883;
            Serial.println("[MQTT] Alternando TLS para porta 8883 por falha persistente");
            saveMqttPreferences();
            mqttNextAttemptMs = now + 1000;
            return;
          }
        }
      } else {
        mqttTlsFailStreak = 0;
      }
      mqttNextAttemptMs = now + 5000;
    }
  }
}

