joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
static bool tlsHandshakeOnce(const String& host, uint16_t port) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[TLS_TEST] WiFi desconectado");
    return false;
  }
  WiFiClientSecure client;
  client.stop();
  client.setHandshakeTimeout(15);
  client.setTimeout(20);
  client.setInsecure();
  uint32_t t0 = millis();
  bool ok = client.connect(host.c_str(), port);
  uint32_t dt = millis() - t0;
  Serial.print("[TLS_TEST] host=");
  Serial.print(host);
  Serial.print(" port=");
  Serial.print(port);
  Serial.print(" ok=");
  Serial.print(ok ? "1" : "0");
  Serial.print(" ms=");
  Serial.print(dt);
  Serial.print(" fd=");
  Serial.println(client.fd());
  client.stop();
  return ok;
}

static bool mqttRawConnackOnce(const String& host, uint16_t port, const String& clientId) {
  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[MQTT_RAW] WiFi desconectado");
    return false;
  }

  WiFiClientSecure client;
  client.stop();
  client.setHandshakeTimeout(15);
  client.setTimeout(20);
  client.setInsecure();

  uint32_t t0 = millis();
  bool ok = client.connect(host.c_str(), port);
  uint32_t tlsMs = millis() - t0;

  Serial.print("[MQTT_RAW] tls host=");
  Serial.print(host);
  Serial.print(" port=");
  Serial.print(port);
  Serial.print(" ok=");
  Serial.print(ok ? "1" : "0");
  Serial.print(" ms=");
  Serial.print(tlsMs);
  Serial.print(" fd=");
  Serial.println(client.fd());

  if (!ok) {
    client.stop();
    return false;
  }

  uint8_t pkt[256];
  size_t cidLen = static_cast<size_t>(clientId.length());
  if (cidLen == 0 || cidLen > 200) {
    client.stop();
    return false;
  }

  size_t vhLen = 10;
  size_t payloadLen = 2 + cidLen;
  size_t remLen = vhLen + payloadLen;
  if (remLen > 127) {
    client.stop();
    return false;
  }

  size_t i = 0;
  pkt[i++] = 0x10;
  pkt[i++] = static_cast<uint8_t>(remLen);
  pkt[i++] = 0x00; pkt[i++] = 0x04;
  pkt[i++] = 'M'; pkt[i++] = 'Q'; pkt[i++] = 'T'; pkt[i++] = 'T';
  pkt[i++] = 0x04;
  pkt[i++] = 0x02;
  pkt[i++] = 0x00; pkt[i++] = 60;
  pkt[i++] = static_cast<uint8_t>((cidLen >> 8) & 0xFF);
  pkt[i++] = static_cast<uint8_t>(cidLen & 0xFF);
  for (size_t k = 0; k < cidLen; k++) {
    pkt[i++] = static_cast<uint8_t>(clientId[k]);
  }

  uint32_t t1 = millis();
  int wr = client.write(pkt, i);
  client.flush();
  uint32_t wrMs = millis() - t1;
  Serial.print("[MQTT_RAW] write bytes=");
  Serial.print(i);
  Serial.print(" wr=");
  Serial.print(wr);
  Serial.print(" ms=");
  Serial.println(wrMs);

  uint8_t resp[4];
  uint32_t deadline = millis() + 3000;
  size_t got = 0;
  while (static_cast<int32_t>(millis() - deadline) < 0 && got < sizeof(resp)) {
    if (!client.connected()) {
      break;
    }
    int av = client.available();
    if (av <= 0) {
      delay(10);
      continue;
    }
    int r = client.read(resp + got, sizeof(resp) - got);
    if (r > 0) got += static_cast<size_t>(r);
    else break;
  }

  Serial.print("[MQTT_RAW] resp_len=");
  Serial.println(got);
  Serial.print("[MQTT_RAW] connected=");
  Serial.println(client.connected() ? "1" : "0");
  if (got == 4) {
    Serial.print("[MQTT_RAW] resp=");
    Serial.print(resp[0], HEX); Serial.print(" ");
    Serial.print(resp[1], HEX); Serial.print(" ");
    Serial.print(resp[2], HEX); Serial.print(" ");
    Serial.println(resp[3], HEX);
  }

  bool connackOk = (got == 4 && resp[0] == 0x20 && resp[1] == 0x02 && resp[2] == 0x00 && resp[3] == 0x00);
  client.stop();
  return connackOk;
}

static void mqttTaskMain(void* pvParameters) {
  for (;;) {
    if (otaInProgress) {
      if (mqttClient.connected()) {
        if (mqttLockMs(50)) {
          mqttClient.disconnect();
          mqttUnlock();
        }
      }
      vTaskDelay(pdMS_TO_TICKS(250));
      continue;
    }
    if (WiFi.status() == WL_CONNECTED) {
      uint32_t now = millis();
      if (!mqttConnectEnabled) {
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }
      if (mqttReadyAtMs != 0 && static_cast<int32_t>(now - mqttReadyAtMs) < 0) {
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }
      reconnectMQTT();
      if (mqttClient.connected()) {
        if (mqttPostConnectPending && mqttPostConnectUntilMs != 0 && static_cast<int32_t>(now - mqttPostConnectUntilMs) >= 0) {
          mqttPostConnectPending = false;
          mqttPostConnectUntilMs = 0;
        }
        if (mqttPostConnectPending) {
          if (mqttLockMs(250)) {
            if (!mqttSubscribed) {
              mqttClient.setSocketTimeout(5);
              String commandTopic = MQTT_TOPIC_BASE + "command";
              bool subOk = mqttClient.subscribe(commandTopic.c_str(), 0);
              mqttSubscribed = subOk;
              Serial.print("[MQTT] Subscribe command ");
              Serial.print(subOk ? "OK " : "FAIL ");
              Serial.println(commandTopic);
            }
            if (mqttSubscribed) {
              String willTopic = MQTT_TOPIC_BASE + "lwt";
              bool pubOk = mqttClient.publish(willTopic.c_str(), "online", true);
              mqttTxCount++;
              mqttLastTxMs = millis();
              Serial.print("[MQTT] LWT online ");
              Serial.println(pubOk ? "OK" : "FAIL");
              publicaStatusMQTT();
              if (!beepNetMqttOkDone && WiFi.status() == WL_CONNECTED) {
                bip(); delay(120);
                bip(); delay(120);
                bip();
                Serial.println("[BUZZER] WiFi+MQTT OK");
                beepNetMqttOkDone = true;
                supabaseLogUsage("MQTT_CONNECTED");
              }
              mqttPostConnectPending = false;
              mqttPostConnectUntilMs = 0;
            }
            mqttUnlock();
          }
        }
        if (mqttLockMs(50)) {
          mqttClient.loop();
          if (mqttTxQueue) {
            MqttTxItem item;
            while (xQueueReceive(mqttTxQueue, &item, 0) == pdTRUE) {
              if (!mqttClient.connected()) {
                continue;
              }
              bool ok = mqttClient.publish(item.topic, item.payload, item.retain);
              mqttTxCount++;
              mqttLastTxMs = millis();
              Serial.print("[MQTT_TX] ");
              Serial.print(ok ? "OK " : "FAIL ");
              Serial.print("topic=");
              Serial.print(item.topic);
              Serial.print(" payload=");
              Serial.println(item.payload);
            }
          }
          mqttUnlock();
        }
      }
    } else {
      beepNetMqttOkDone = false;
      mqttPostConnectPending = false;
      mqttSubscribed = false;
      mqttPostConnectUntilMs = 0;
      if (mqttClient.connected()) {
        if (mqttLockMs(50)) {
          mqttClient.disconnect();
          mqttUnlock();
        }
      }
    }
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

static bool isGavetaAbertaRaw();

void publicaStatusMQTT() {
  if (mqttClient.connected()) {
    String statusTopic = MQTT_TOPIC_BASE + "status";
    StaticJsonDocument<896> doc;
    doc["fwVersion"] = FIRMWARE_VERSION;
    doc["otaEnabled"] = otaEnabled;
    if (otaPendingVersion.length() > 0) {
      doc["otaPending"] = otaPendingVersion;
    }
    doc["wifiConnected"] = (WiFi.status() == WL_CONNECTED);
    if (WiFi.status() == WL_CONNECTED) {
      doc["wifiSsid"] = WiFi.SSID();
      doc["wifiIp"] = WiFi.localIP().toString();
    }
    doc["hourMeter"] = horimetro;
    doc["enabled"] = cadeiraHabilitada;
    doc["maintenanceRequired"] = manutencaoNecessaria;
    doc["reflectorOn"] = estado_r;
    doc["backUpOn"] = estado_se;
    doc["backDownOn"] = estado_de;
    doc["seatUpOn"] = estado_sa;
    doc["seatDownOn"] = estado_da;
    doc["upperLegsOn"] = estado_sp;
    doc["lowerLegsOn"] = estado_dp;
    doc["trendUpOn"] = estado_trend_sobe;
    doc["trendDownOn"] = estado_trend_desce;
    doc["backPosition"] = incoder_virtual_encosto_service;
    doc["seatPosition"] = incoder_virtual_asento_service;
    doc["legPosition"] = incoder_virtual_perneira_service;
    doc["gavetaOpen"] = isGavetaAbertaRaw();
    doc["gavetaLockIgnored"] = ignoreGavetaLock;
    if (TREN_INT_DESCE >= 0) doc["trenIntDown"] = (digitalRead(TREN_INT_DESCE) == HIGH);
    if (INT_TREND_DESCE >= 0) doc["trendIntDown"] = (digitalRead(INT_TREND_DESCE) == HIGH);
    if (TREN_INT_SOBE >= 0) doc["trenIntUp"] = (digitalRead(TREN_INT_SOBE) == HIGH);
    if (INT_TREND_SOBE >= 0) doc["trendIntUp"] = (digitalRead(INT_TREND_SOBE) == HIGH);
    String ts = getTimestamp();
    if (ts.length() > 0 && ts != "null") {
      doc["timestamp"] = ts;
    }

    String statusMsg;
    serializeJson(doc, statusMsg);
    mqttEnqueuePublish(statusTopic, statusMsg, true);
  }
}

