joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
static bool releLigado(int pin) {
  if (pin < 0) return false;
  int v = digitalRead(pin);
  if (pin == Rele_DP && RELE_DP_ACTIVE_LOW) {
    return v == LOW;
  }
  return v == HIGH;
}

static void setOutputPin(int pin, bool on, const char* src, bool log = true) {
  int newValue = on ? HIGH : LOW;
  if (pin == Rele_DP && RELE_DP_ACTIVE_LOW) {
    newValue = on ? LOW : HIGH;
  }
  int oldValue = digitalRead(pin);
  if (oldValue == newValue) {
    return;
  }
  digitalWrite(pin, newValue);
  int readBack = digitalRead(pin);
  if (pin == Rele_SA || pin == Rele_DA || pin == Rele_SE || pin == Rele_DE || pin == Rele_SP || pin == Rele_DP || pin == Rele_refletor || pin == Rele_TREND_SOBE || pin == Rele_TREND_DESCE) {
    mqttStatusDirty = true;
  }
  if (!log) {
    return;
  }
  Serial.print("[GPIO_OUT] ");
  Serial.print(relayLabelByPin(pin));
  Serial.print("(GPIO");
  Serial.print(pin);
  Serial.print(")=");
  Serial.print(on ? "1" : "0");
  Serial.print(" RB=");
  Serial.print(readBack == HIGH ? "1" : "0");
  if (src && src[0] != '\0') {
    Serial.print(" ");
    Serial.print(src);
  }
  Serial.println();
}

#if defined(I2C_SDA) && defined(I2C_SCL)
  #if (I2C_SDA == PIN_RELE_SA) || (I2C_SCL == PIN_RELE_SA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SA"
  #endif
  #if (I2C_SDA == PIN_RELE_DA) || (I2C_SCL == PIN_RELE_DA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DA"
  #endif
  #if (I2C_SDA == PIN_RELE_SE) || (I2C_SCL == PIN_RELE_SE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SE"
  #endif
  #if (I2C_SDA == PIN_RELE_DE) || (I2C_SCL == PIN_RELE_DE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DE"
  #endif
  #if (I2C_SDA == PIN_RELE_SP) || (I2C_SCL == PIN_RELE_SP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SP"
  #endif
  #if (I2C_SDA == PIN_RELE_DP) || (I2C_SCL == PIN_RELE_DP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DP"
  #endif
  #if (I2C_SDA == PIN_RELE_REFLETOR) || (I2C_SCL == PIN_RELE_REFLETOR)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_REFLETOR"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_DESCE) || (I2C_SCL == PIN_RELE_TREND_DESCE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_DESCE"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_SOBE) || (I2C_SCL == PIN_RELE_TREND_SOBE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_SOBE"
  #endif
#endif

static int botaoResetWifiPin = RF;
static bool rfHabilitado = true;

// VariÃ¡veis de estado dos botÃµes
int buttonState = 0;
int buttonState1 = 0;
int buttonState2 = 0;
int buttonState3 = 0;
int buttonState4 = 0;
int buttonState5 = 0;
int buttonState6 = 0;
int buttonState7 = 0;
int buttonState8 = 0;
int buttonState9 = 0;
int buttonState10 = 0;
int buttonState11 = 0;
int buttonState12 = 0;

unsigned long previousMillis = 0;
unsigned long currentMillis;
unsigned long interval = 500;

int ledState = 0;
int cont = 0;
int contador = 0;
int contador1 = 0;
int contador2 = 0;
int cont15 = 0;
int contador21 = 0;

// VariÃ¡veis do encoder virtual
int incoder_virtual_encosto_M1 = 0;
int incoder_virtual_asento_M1 = 0;
int incoder_virtual_perneira_M1 = 0;
int cont_bt_m1 = 0;
int incoder_virtual_encosto_service = 0;
int incoder_virtual_asento_service = 0;
int incoder_virtual_perneira_service = 0;
int cont12 = 0;

// Limites do encoder virtual
int fim_encosto_encoder = 0;
int fim_asento_encoder = 0;
int fim_perneira_encoder = 0;
static bool calibrationInProgress = false;

int cont13 = 0;

bool estado_r = 0;
bool estado_sp = 0;
bool estado_dp = 0;
bool estado_sa = 0;
bool estado_da = 0;
bool estado_se = 0;
bool estado_de = 0;
bool estado_trend_sobe = 0;
bool estado_trend_desce = 0;
bool faz_bt_seg = 0;

volatile uint32_t pulses_encosto = 0;
volatile uint32_t pulses_assento = 0;
volatile uint32_t pulses_perneira = 0;
volatile uint32_t pulses_trend = 0;
static uint32_t last_pulses_encosto = 0;
static uint32_t last_pulses_assento = 0;
static uint32_t last_pulses_perneira = 0;
static uint32_t last_pulses_trend = 0;
static uint32_t trendLastPulseAtMs = 0;
static uint32_t last_pulses_trend_travel = 0;

static uint64_t motorTravelPulsesEncosto = 0;
static uint64_t motorTravelPulsesAssento = 0;
static uint64_t motorTravelPulsesPerneira = 0;
static uint64_t motorTravelPulsesTrend = 0;
static uint64_t motorTravelUnsavedEncosto = 0;
static uint64_t motorTravelUnsavedAssento = 0;
static uint64_t motorTravelUnsavedPerneira = 0;
static uint64_t motorTravelUnsavedTrend = 0;
static float mmPerPulseEncosto = 0.01f;
static float mmPerPulseAssento = 0.01f;
static float mmPerPulsePerneira = 0.01f;
static float mmPerPulseTrend = 0.01f;
static uint32_t motorTravelNextSaveMs = 0;
static uint32_t motorTravelNextSendMs = 0;
static const uint32_t MOTOR_TRAVEL_SAVE_INTERVAL_MS = 10000;
static const uint32_t MOTOR_TRAVEL_SEND_INTERVAL_MS = 900000;
static bool encoderPulseDebug = false;

// Mapeamento solicitado:
// ENCODER1 -> Assento
// ENCODER2 -> Perneira
// ENCODER3 -> Encosto
static void IRAM_ATTR isr_encoder1() { pulses_assento++; }
static void IRAM_ATTR isr_encoder2() { pulses_perneira++; }
static void IRAM_ATTR isr_encoder3() { pulses_encosto++; }
static void IRAM_ATTR isr_encoder_trend() { pulses_trend++; }

// Debounce para comandos BLE
unsigned long ultimoComandoBLE = 0;
String ultimoCmdBLE = "";
unsigned long ultimoComandoRemoto = 0;

// Timeout para motores (dead man's switch) - desliga se não receber comando
const unsigned long MOTOR_TIMEOUT = 1000; // 1 segundo
unsigned long ultimoComandoSE = 0;
unsigned long ultimoComandoDE = 0;
unsigned long ultimoComandoSA = 0;
unsigned long ultimoComandoDA = 0;
unsigned long ultimoComandoSP = 0;
unsigned long ultimoComandoDP = 0;
unsigned long ultimoComandoTrendSobe = 0;
unsigned long ultimoComandoTrendDesce = 0;
const uint32_t VZ_MAX_TIME_MS = 15000;

// Flags para controle de fim de curso do encoder
bool en_SA_acabou = false;
bool en_DA_acabou = false;
bool en_SE_acabou = false;
bool en_DE_acabou = false;
bool en_SP_acabou = false;
bool en_DP_acabou = false;

bool faz_m1 = false;

// Travas de botÃµes baseadas no encoder virtual
bool trava_bt_DA = true;
bool trava_bt_SA = false;
bool trava_bt_SE = true;
bool trava_bt_DE = false;
bool trava_bt_DP = true;
bool trava_bt_SP = false;

unsigned long currentMillis20 = 0;
unsigned long previousMillis_amostra20 = 0;
unsigned long ultimoMillisEncoder = 0;
unsigned long ultimoMillisPiscaLed = 0;
bool estadoLedPisca = false;
const unsigned long INTERVALO_ENCODER = 250;
bool habilitaEncoderVirtual = true; // Controle para desabilitar encoder durante VZ inicial
bool vzInicialEmAndamento = false; // Flag para bloquear loop() durante VZ inicial

void monitoraSistema();

// ========== SETUP ==========
void setup() {
  bootStartedAtMs = millis();
  // WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); // Desabilita detector de Brownout - not needed in Arduino
  setCpuFrequencyMhz(80); // Reduz frequÃªncia para 80MHz durante inicializaÃ§Ã£o
  
