joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
  Serial.begin(115200);
  delay(2000);

#if ESP_IDF_VERSION_MAJOR >= 5
  esp_task_wdt_deinit();
  esp_task_wdt_config_t twdt_config = {
      .timeout_ms = 120000,
      .idle_core_mask = (1 << 0) | (1 << 1),
      .trigger_panic = true,
  };
  esp_task_wdt_init(&twdt_config);
#else
  esp_task_wdt_deinit();
  esp_task_wdt_init(120, true);
#endif

#if I2C_EARLY_TEST
  #if defined(I2C_SDA) && defined(I2C_SCL)
  pinMode(I2C_SDA, INPUT_PULLUP);
  pinMode(I2C_SCL, INPUT_PULLUP);
  Wire.begin(I2C_SDA, I2C_SCL);
  #elif defined(PCF8575_SDA) && defined(PCF8575_SCL)
  pinMode(PCF8575_SDA, INPUT_PULLUP);
  pinMode(PCF8575_SCL, INPUT_PULLUP);
  Wire.begin(PCF8575_SDA, PCF8575_SCL);
  #else
  Wire.begin();
  #endif
  Wire.setClock(I2C_CLOCK_HZ);
  Serial.println("\n=== I2C EARLY TEST MODE ===");
  Serial.print("[I2C] Clock: ");
  Serial.println(I2C_CLOCK_HZ);
  #if defined(I2C_SDA) && defined(I2C_SCL)
  Serial.print("[I2C] SDA=");
  Serial.print(I2C_SDA);
  Serial.print(" SCL=");
  Serial.println(I2C_SCL);
  Serial.print("[I2C] SDA level=");
  Serial.print(digitalRead(I2C_SDA));
  Serial.print(" SCL level=");
  Serial.println(digitalRead(I2C_SCL));
  #endif
  Serial.println("Digite: I2C_SCAN, PCF8574_PING, PCF8574_TEST");
  Serial.print("[I2C] Scan inicial: ");
  Serial.println(i2cScanSummary());
  while (true) {
    processaComandosSerialDebug();
    delay(10);
  }
#endif
  
  Serial.println("\n--- INICIALIZANDO SISTEMA ---");
  Serial.print("CPU0 Reset Reason: "); Serial.println(esp_reset_reason());
  Serial.print("CPU1 Reset Reason: "); Serial.println(esp_reset_reason());
  
  // Gera nÃºmero de sÃ©rie Ãºnico baseado no MAC ID do ESP32
  Serial.println("Gerando numero de serie...");
  NUMERO_SERIE_CADEIRA = geraNumeroSerieDoMAC();
  Serial.print("Numero de Serie: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  
  // Define base dos tópicos MQTT
  MQTT_TOPIC_BASE = NUMERO_SERIE_CADEIRA + "/";
  loadMqttPreferences();
  applyMqttRuntimeConfig();
  
  // Gera nome do dispositivo (últimos 4 dígitos do MAC)
  uint8_t mac[6];
  WiFi.macAddress(mac);
  char nomeTemp[20];
  snprintf(nomeTemp, sizeof(nomeTemp), "CadeiraOdonto-%02X%02X", mac[4], mac[5]);
  NOME_DISPOSITIVO = String(nomeTemp);
  Serial.print("Nome do Dispositivo: ");
  Serial.println(NOME_DISPOSITIVO);
  delay(500);

  IO_begin();
  
  // ConfiguraÃ§Ã£o de pinos primeiro (menor consumo)
  Serial.println("Configurando pinos GPIO...");

  // Inicializa pinos de entrada com pull-up
  loadGavetaPinPreference();
  loadCalibracaoLimites();
  pinMode(DE, INPUT_PULLUP);
  pinMode(SA, INPUT_PULLUP);
  pinMode(DA, INPUT_PULLUP);
  pinMode(SE, INPUT_PULLUP);
  pinMode(RF, INPUT_PULLUP);
  pinMode(VZ, INPUT_PULLUP);
  pinMode(PT, INPUT_PULLUP);
  pinMode(SP, INPUT_PULLUP);
  pinMode(DP, INPUT_PULLUP);
  pinMode(M1, INPUT_PULLUP);
  if (TREN_INT_DESCE >= 0) {
    pinMode(TREN_INT_DESCE, INPUT_PULLDOWN);
    Serial.print("[TREND] TREN_INT_DESCE(GPIO");
    Serial.print(TREN_INT_DESCE);
    Serial.println(")");
  }
  if (INT_TREND_DESCE >= 0) {
    pinMode(INT_TREND_DESCE, INPUT_PULLDOWN);
    Serial.print("[TREND] INT_TREND_DESCE(GPIO");
    Serial.print(INT_TREND_DESCE);
    Serial.println(")");
  }
  if (TREN_INT_SOBE >= 0) {
    pinMode(TREN_INT_SOBE, INPUT_PULLDOWN);
    Serial.print("[TREND] TREN_INT_SOBE(GPIO");
    Serial.print(TREN_INT_SOBE);
    Serial.println(")");
  }
  if (INT_TREND_SOBE >= 0) {
    pinMode(INT_TREND_SOBE, INPUT_PULLDOWN);
    Serial.print("[TREND] INT_TREND_SOBE(GPIO");
    Serial.print(INT_TREND_SOBE);
    Serial.println(")");
  }
  if (GAVETA >= 0) {
    pinMode(GAVETA, INPUT_PULLUP);
    Serial.print("[GAVETA] GPIO=");
    Serial.println(GAVETA);
  } else {
    Serial.println("[GAVETA] DESABILITADO");
  }
  pinMode(ENCODER1, INPUT_PULLUP);
  pinMode(ENCODER2, INPUT_PULLUP);
  pinMode(ENCODER3, INPUT_PULLUP);
  if (ENCODER_TREND >= 0) {
    pinMode(ENCODER_TREND, INPUT_PULLUP);
  }
  if (TEST_MODE) {
    Serial.println("[ENC] TEST_MODE=1: interrupcoes de encoder desabilitadas");
  } else {
    if (ENCODER1 >= 0 && ENCODER1 != I2C_SDA && ENCODER1 != I2C_SCL && ENCODER1 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER1), isr_encoder1, FALLING);
    } else {
      Serial.println("[ENC] ENCODER1 desabilitado");
    }
    if (ENCODER2 >= 0 && ENCODER2 != I2C_SDA && ENCODER2 != I2C_SCL && ENCODER2 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER2), isr_encoder2, FALLING);
    } else {
      Serial.println("[ENC] ENCODER2 desabilitado");
    }
    if (ENCODER3 >= 0 && ENCODER3 != I2C_SDA && ENCODER3 != I2C_SCL && ENCODER3 != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER3), isr_encoder3, FALLING);
    } else {
      Serial.println("[ENC] ENCODER3 desabilitado");
    }
    if (ENCODER_TREND >= 0 && ENCODER_TREND != I2C_SDA && ENCODER_TREND != I2C_SCL && ENCODER_TREND != Rele_refletor) {
      attachInterrupt(digitalPinToInterrupt(ENCODER_TREND), isr_encoder_trend, FALLING);
    } else {
      Serial.println("[ENC] ENCODER_TREND desabilitado");
    }
  }

  // Inicializa pinos de saÃ­da
  pinMode(Rele_SA, OUTPUT);
  pinMode(Rele_DA, OUTPUT);
  pinMode(Rele_SE, OUTPUT);
  pinMode(Rele_DE, OUTPUT);
  pinMode(Rele_DP, OUTPUT);
  pinMode(Rele_SP, OUTPUT);
  pinMode(BUZZER, OUTPUT);
  digitalWrite(BUZZER, LOW);
  pinMode(LED, OUTPUT);
  pinMode(Rele_refletor, OUTPUT);
  if (Rele_TREND_DESCE >= 0) pinMode(Rele_TREND_DESCE, OUTPUT);
  if (Rele_TREND_SOBE >= 0) pinMode(Rele_TREND_SOBE, OUTPUT);

  // Desliga todos os relÃ©s no inÃ­cio
  setOutputPin(Rele_SA, false, nullptr, false);
  setOutputPin(Rele_DA, false, nullptr, false);
  setOutputPin(Rele_SE, false, nullptr, false);
  setOutputPin(Rele_DE, false, nullptr, false);
  setOutputPin(Rele_DP, false, nullptr, false);
  setOutputPin(Rele_SP, false, nullptr, false);
  setOutputPin(Rele_refletor, false, nullptr, false);
  if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, nullptr, false);
  if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, nullptr, false);
  Serial.println("Pinos configurados.");
  delay(500);

  if (RF == Rele_SA || RF == Rele_DA || RF == Rele_SE || RF == Rele_DE || RF == Rele_SP || RF == Rele_DP || RF == Rele_refletor || RF == BUZZER || RF == LED) {
    rfHabilitado = false;
    botaoResetWifiPin = -1;
    Serial.println("[ERRO] RF conflita com um pino de saida. RF desabilitado.");
  } else {
    rfHabilitado = true;
    botaoResetWifiPin = RF;
  }

  inicializaEstadosDeBordaBotoes();
  loadMotorTravelPreferences();

#if PORTS_ONLY
  Serial.println("\n=== PORTS ONLY MODE ===");
  Serial.println("Comandos: I2C_SCAN | PCF8574_PING | PCF8574_TEST | PCF8574_BTNS | GPIO_BTNS | PCF8574_INT");
  bip();
  return;
#endif

#if PORTS_VERIFY
  Serial.println("\n=== PORTS VERIFY MODE ===");
  Serial.println("Teste completo: botoes (PCF8574) -> rotinas -> reles (GPIO)");
  Serial.println("Use: PCF8574_BTNS | PCF8574_INT | GPIO_BTNS");
  bip();
  return;
#endif

#if OFFLINE_MODE
  Serial.println("Inicio programa cadeira GO - MODO OFFLINE (sem BLE/WiFi/MQTT/Supabase/OTA)");
  Serial.println("Carregando preferencias...");
  carregaPreferencias();
  delay(500);
  setCpuFrequencyMhz(240);
  Serial.println("Comandos via Serial (115200): SE DE SA DA SP DP STOP VZ PT M1 STATUS I2C_SCAN PCF8574_BTNS GPIO_BTNS");
  executa_vz_ini();
  Serial.println("\n====================================");
  Serial.println("   SISTEMA PRONTO (OFFLINE)!");
  Serial.println("====================================");
  Serial.print("Serial: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  Serial.print("Memoria livre: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  return;
#endif

  Serial.println("Inicio programa cadeira GO - Com WiFiManager + Supabase");

  // Carrega dados salvos (encoder virtual e horÃ­metro)
  Serial.println("Carregando preferencias...");
  carregaPreferencias();
  otaLoadPreferences();
  delay(500);

  // Volta CPU para 240MHz antes do WiFi
  setCpuFrequencyMhz(240);
  Serial.println("CPU em 240MHz - Iniciando WiFi...");
  delay(1000);

  // Configura e conecta WiFi usando WiFiManager
  configuraWiFiManager();

  // Inicializa MQTT se WiFi estiver conectado
  if (WiFi.status() == WL_CONNECTED) {
    mqttConnectEnabled = false;
    mqttReadyAtMs = 0;
    Serial.println("\n====================================");
    Serial.println("  INICIALIZANDO MQTT");
    Serial.println("====================================");
    applyMqttRuntimeConfig();
    mqttClient.setCallback(mqttCallback);
    Serial.print("Servidor MQTT: ");
    Serial.println(mqttHost);
    Serial.print("Porta: ");
    Serial.println(mqttPort);
    Serial.print("TLS: ");
    Serial.println(mqttUseTls ? "SIM" : "NAO");
    Serial.print("Usuario: ");
    Serial.println(mqttUser.length() > 0 ? mqttUser : "(vazio)");
    Serial.print("Base dos tópicos: ");
    Serial.println(MQTT_TOPIC_BASE);
    Serial.println("====================================\n");
  }

  if (!mqttMutex) {
    mqttMutex = xSemaphoreCreateRecursiveMutex();
  }
  if (!mqttCommandQueue) {
    mqttCommandQueue = xQueueCreate(10, sizeof(MqttCmdItem));
  }
  if (!mqttTxQueue) {
    mqttTxQueue = xQueueCreate(8, sizeof(MqttTxItem));
  }
  if (!mqttTaskHandle) {
    xTaskCreatePinnedToCore(mqttTaskMain, "mqtt", 24576, NULL, 1, &mqttTaskHandle, 1);
  }
  otaValidateAfterBoot();

