joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
  // Delay para estabilizar rede
  Serial.println("Aguardando estabilizacao da rede...");
  delay(2000);

  // Sincroniza horário com servidor NTP
  if (WiFi.status() == WL_CONNECTED) {
    sincronizaNTP();
  }

  if (WiFi.status() == WL_CONNECTED) {
    uint32_t waitUntil = millis() + 12000;
    while (!mqttClient.connected() && static_cast<int32_t>(millis() - waitUntil) < 0) {
      reconnectMQTT();
      delay(200);
    }
  }

  Serial.println("\n====================================");
  Serial.println("  INICIANDO CONEXAO COM SUPABASE");
  Serial.println("====================================");
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi Status: CONECTADO | IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Heap livre antes: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    
    verificaStatusCadeira();
    
    Serial.print("Heap livre depois: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    Serial.println("[OK] Verificacao de status concluida.");
  } else {
    Serial.println("WiFi Status: DESCONECTADO");
    Serial.println("[INFO] Pulando verificacao inicial - modo offline.");
  }

  if (WiFi.status() == WL_CONNECTED) {
    mqttConnectEnabled = true;
    mqttReadyAtMs = millis() + 1000;
  }

  Serial.println("\n====================================");
  Serial.println("  EXECUTANDO VZ INICIAL");
  Serial.println("  (APOS WiFi/MQTT/Supabase)");
  Serial.println("====================================");
  executa_vz_ini();
  Serial.println("[OK] VZ inicial finalizado.");
  Serial.println("====================================\n");
  
  Serial.println("\n====================================");
  Serial.println("       SISTEMA PRONTO!");
  Serial.println("====================================");
  Serial.print("Nome: ");
  Serial.println(NOME_DISPOSITIVO);
  Serial.print("Serial: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  Serial.print("WiFi: ");
  Serial.println(WiFi.status() == WL_CONNECTED ? "ONLINE" : "OFFLINE");
  Serial.print("Memoria livre: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  Serial.println("====================================");
}

static bool trendInputsConfigured() {
  return TREN_INT_DESCE >= 0 || INT_TREND_DESCE >= 0 || TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0;
}

static bool trendReadDebouncedHigh(int pin, bool& initialized, bool& raw, bool& stable, uint32_t& changedAtMs) {
  static const uint32_t TREND_DEBOUNCE_MS = 40;
  if (pin < 0) {
    return false;
  }
  uint32_t now = millis();
  bool cur = digitalRead(pin);
  if (!initialized) {
    initialized = true;
    raw = cur;
    stable = cur;
    changedAtMs = now;
    return stable == HIGH;
  }
  if (cur != raw) {
    raw = cur;
    changedAtMs = now;
  }
  if ((now - changedAtMs) < TREND_DEBOUNCE_MS) {
    return stable == HIGH;
  }
  stable = raw;
  return stable == HIGH;
}

static void trendDebugDump(const char* tag) {
  bool hasUpPins = (TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0);
  bool mapUpRaw = false;
  bool mapDownRaw = false;
  if (hasUpPins) {
    if (TREN_INT_SOBE >= 0 && digitalRead(TREN_INT_SOBE) == HIGH) mapUpRaw = true;
    if (INT_TREND_SOBE >= 0 && digitalRead(INT_TREND_SOBE) == HIGH) mapUpRaw = true;
  } else {
    if (INT_TREND_DESCE >= 0 && digitalRead(INT_TREND_DESCE) == HIGH) mapUpRaw = true;
  }
  if (TREN_INT_DESCE >= 0 && digitalRead(TREN_INT_DESCE) == HIGH) mapDownRaw = true;

  String msg = "[TREND_DBG] ";
  msg += (tag ? tag : "DUMP");
  msg += " GPIO_IN{";
  msg += "TREN_D=";
  msg += (TREN_INT_DESCE >= 0 ? String(digitalRead(TREN_INT_DESCE) == HIGH ? 1 : 0) : "NA");
  msg += ",INT_D=";
  msg += (INT_TREND_DESCE >= 0 ? String(digitalRead(INT_TREND_DESCE) == HIGH ? 1 : 0) : "NA");
  msg += ",TREN_U=";
  msg += (TREN_INT_SOBE >= 0 ? String(digitalRead(TREN_INT_SOBE) == HIGH ? 1 : 0) : "NA");
  msg += ",INT_U=";
  msg += (INT_TREND_SOBE >= 0 ? String(digitalRead(INT_TREND_SOBE) == HIGH ? 1 : 0) : "NA");
  msg += "} GPIO_OUT{";
  msg += "D=";
  msg += (Rele_TREND_DESCE >= 0 ? String(digitalRead(Rele_TREND_DESCE) == HIGH ? 1 : 0) : "NA");
  msg += ",U=";
  msg += (Rele_TREND_SOBE >= 0 ? String(digitalRead(Rele_TREND_SOBE) == HIGH ? 1 : 0) : "NA");
  msg += "} STATE{";
  msg += "upOn=";
  msg += (estado_trend_sobe ? "1" : "0");
  msg += ",downOn=";
  msg += (estado_trend_desce ? "1" : "0");
  msg += "} MAP{";
  msg += "U=";
  msg += (mapUpRaw ? "1" : "0");
  msg += ",D=";
  msg += (mapDownRaw ? "1" : "0");
  msg += "}";
  Serial.println(msg);
}

static void trendDebugTick() {
  if (!trendDebugEnabled) {
    return;
  }
  uint32_t now = millis();
  if (now < trendDebugNextMs) {
    return;
  }
  trendDebugNextMs = now + trendDebugIntervalMs;
  trendDebugDump("TICK");
}

static void trendTickInputs() {
  if (!trendInputsConfigured()) {
    return;
  }
  if (Rele_TREND_SOBE < 0 && Rele_TREND_DESCE < 0) {
    return;
  }

  static bool init_trenUp = false, raw_trenUp = false, stable_trenUp = false;
  static uint32_t chg_trenUp = 0;
  static bool init_trendUp = false, raw_trendUp = false, stable_trendUp = false;
  static uint32_t chg_trendUp = 0;
  static bool init_trenDown = false, raw_trenDown = false, stable_trenDown = false;
  static uint32_t chg_trenDown = 0;
  static bool init_intDesceAsUp = false, raw_intDesceAsUp = false, stable_intDesceAsUp = false;
  static uint32_t chg_intDesceAsUp = 0;

  bool hasUpPins = (TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0);
  bool up = false;
  if (hasUpPins) {
    up = trendReadDebouncedHigh(TREN_INT_SOBE, init_trenUp, raw_trenUp, stable_trenUp, chg_trenUp) ||
         trendReadDebouncedHigh(INT_TREND_SOBE, init_trendUp, raw_trendUp, stable_trendUp, chg_trendUp);
  } else {
    up = trendReadDebouncedHigh(INT_TREND_DESCE, init_intDesceAsUp, raw_intDesceAsUp, stable_intDesceAsUp, chg_intDesceAsUp);
  }

  bool down = trendReadDebouncedHigh(TREN_INT_DESCE, init_trenDown, raw_trenDown, stable_trenDown, chg_trenDown);

  static bool lastConflict = false;
  bool conflict = up && down;
  if (conflict) {
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TREND_IN");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TREND_IN");
    estado_trend_sobe = false;
    estado_trend_desce = false;
    faz_bt_seg = 0;
    paraTimerMotor();
    if (!lastConflict) {
      enviarBLE("TREND:CONFLICT");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_CONFLICT", false);
      mqttStatusDirty = true;
    }
    lastConflict = true;
    return;
  }
  lastConflict = false;

