joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
  if (up) {
    ultimoComandoTrendSobe = millis();
    trendLastPulseAtMs = ultimoComandoTrendSobe;
    last_pulses_trend = pulses_trend;
    estado_trend_sobe = true;
    estado_trend_desce = false;
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TREND_IN");
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, true, "TREND_IN");
    faz_bt_seg = 1;
    iniciaTimerMotor();
    mqttStatusDirty = true;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_UP_ON", false);
    return;
  }
  if (down) {
    ultimoComandoTrendDesce = millis();
    trendLastPulseAtMs = ultimoComandoTrendDesce;
    last_pulses_trend = pulses_trend;
    estado_trend_desce = true;
    estado_trend_sobe = false;
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TREND_IN");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, true, "TREND_IN");
    faz_bt_seg = 1;
    iniciaTimerMotor();
    mqttStatusDirty = true;
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_DOWN_ON", false);
    return;
  }

  if (estado_trend_sobe || estado_trend_desce) {
    bool wasUp = estado_trend_sobe;
    bool wasDown = estado_trend_desce;
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TREND_IN");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TREND_IN");
    estado_trend_sobe = false;
    estado_trend_desce = false;
    faz_bt_seg = 0;
    paraTimerMotor();
    mqttStatusDirty = true;
    enviarBLE("TREND:OFF");
    if (wasUp) mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_UP_OFF", false);
    if (wasDown) mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_DOWN_OFF", false);
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_OFF", false);
  }
}

// ========== MONITORAMENTO DE TIMEOUT DOS MOTORES (DEAD MAN'S SWITCH) ==========
void verificaTimeoutMotores() {
  unsigned long agora = millis();
  uint32_t curTrend = pulses_trend;
  if (curTrend != last_pulses_trend) {
    last_pulses_trend = curTrend;
    trendLastPulseAtMs = agora;
  }
  
  // SE - Encosto sobe
  if (estado_se && (agora - ultimoComandoSE) > MOTOR_TIMEOUT) {
    estado_se = false;
    setOutputPin(Rele_SE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SE:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SE desligado por seguranca");
  }
  
  // DE - Encosto desce
  if (estado_de && (agora - ultimoComandoDE) > MOTOR_TIMEOUT) {
    estado_de = false;
    setOutputPin(Rele_DE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DE:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DE desligado por seguranca");
  }
  
  // SA - Assento sobe
  if (estado_sa && (agora - ultimoComandoSA) > MOTOR_TIMEOUT) {
    estado_sa = false;
    setOutputPin(Rele_SA, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SA:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SA desligado por seguranca");
  }
  
  // DA - Assento desce
  if (estado_da && (agora - ultimoComandoDA) > MOTOR_TIMEOUT) {
    estado_da = false;
    setOutputPin(Rele_DA, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DA:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DA desligado por seguranca");
  }
  
  // SP - Pernas sobem
  if (estado_sp && (agora - ultimoComandoSP) > MOTOR_TIMEOUT) {
    estado_sp = false;
    setOutputPin(Rele_SP, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("SP:TIMEOUT");
    Serial.println("[TIMEOUT] Motor SP desligado por seguranca");
  }
  
  // DP - Pernas descem
  if (estado_dp && (agora - ultimoComandoDP) > MOTOR_TIMEOUT) {
    estado_dp = false;
    setOutputPin(Rele_DP, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("DP:TIMEOUT");
    Serial.println("[TIMEOUT] Motor DP desligado por seguranca");
  }

  // TS - Trend sobe
  bool tsInputActive = false;
  if (TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0) {
    if (TREN_INT_SOBE >= 0 && digitalRead(TREN_INT_SOBE) == HIGH) tsInputActive = true;
    if (INT_TREND_SOBE >= 0 && digitalRead(INT_TREND_SOBE) == HIGH) tsInputActive = true;
  } else {
    if (INT_TREND_DESCE >= 0 && digitalRead(INT_TREND_DESCE) == HIGH) tsInputActive = true;
  }
  if (estado_trend_sobe && !tsInputActive && (agora - ultimoComandoTrendSobe) > MOTOR_TIMEOUT) {
    estado_trend_sobe = false;
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("TS:TIMEOUT");
    Serial.println("[TIMEOUT] Motor TS desligado por seguranca");
  }

  // TD - Trend desce
  bool tdInputActive = false;
  if (TREN_INT_DESCE >= 0 && digitalRead(TREN_INT_DESCE) == HIGH) tdInputActive = true;
  if (estado_trend_desce && !tdInputActive && (agora - ultimoComandoTrendDesce) > MOTOR_TIMEOUT) {
    estado_trend_desce = false;
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TIMEOUT");
    faz_bt_seg = 0;
    enviarBLE("TD:TIMEOUT");
    Serial.println("[TIMEOUT] Motor TD desligado por seguranca");
  }

  if ((estado_trend_sobe || estado_trend_desce) && ENCODER_TREND >= 0 && trendLastPulseAtMs > 0 && (agora - trendLastPulseAtMs) > 500) {
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TREND_ENC");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TREND_ENC");
    estado_trend_sobe = false;
    estado_trend_desce = false;
    faz_bt_seg = 0;
    enviarBLE("TREND:STALL");
    Serial.println("[TREND_ENC] Sem pulsos. Trend desligado por seguranca");
  }
}

// ========== LOOP PRINCIPAL ==========
void loop() {
#if PORTS_ONLY || PORTS_VERIFY
  if (pcf8574InterruptPending) {
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    if (okRead) {
      pcf8574ReportChanges(pcf8574LastIn, in);
      pcf8574LastIn = in;
    }
    pcf8574InterruptPending = false;
  }
  processaComandosBluetooth();
#if PORTS_VERIFY
  Button_geral();
  Button_Seg();
  monitora_tempo_rele();
  contagem_tempo_incoder_virtual();
#endif
  delay(10);
  return;
#endif
  // Se VZ inicial estiver em andamento, nÃ£o executa nada do loop
  if (vzInicialEmAndamento) {
    delay(100);
    return;
  }
  
#if !OFFLINE_MODE
  // Verifica se botÃ£o de reset WiFi foi pressionado por 5 segundos
  verificaBotaoResetWifi();
#endif
  
  // Verifica timeout dos motores (dead man's switch)
  verificaTimeoutMotores();
  
  // Processa comandos Bluetooth do app
  processaComandosBluetooth();
#if !OFFLINE_MODE
  if (mqttCommandQueue) {
    MqttCmdItem item;
    while (xQueueReceive(mqttCommandQueue, &item, 0) == pdTRUE) {
      String cmd = String(item.cmd);
      cmd.trim();
      if (cmd.length() > 0) {
        executaComandoBluetooth(cmd, "MQTT");
      }
    }
  }
#endif
  trendTickInputs();
  trendDebugTick();

  // Monitoramento do sistema (Debug)
  monitoraSistema();

  // Atualiza horÃ­metro
  atualizaHorimetro();

#if !OFFLINE_MODE
  // Envia dados ao Supabase periodicamente
  atualizaSupabase();
  sendMotorTravelToSupabaseIfNeeded();

  // Verifica status da cadeira periodicamente
  verificacaoPeriodicaStatus();
#endif

