joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
    pinMode(I2C_SDA, OUTPUT);
    pinMode(I2C_SCL, OUTPUT);
    for (int i = 0; i < 10; i++) {
      digitalWrite(I2C_SDA, (i % 2) ? HIGH : LOW);
      digitalWrite(I2C_SCL, (i % 2) ? LOW : HIGH);
      delay(250);
    }
    digitalWrite(I2C_SDA, HIGH);
    digitalWrite(I2C_SCL, HIGH);
    pinMode(I2C_SDA, INPUT_PULLUP);
    pinMode(I2C_SCL, INPUT_PULLUP);

    i2cReady = Wire.begin(I2C_SDA, I2C_SCL);
    if (i2cReady) {
      Wire.setClock(I2C_CLOCK_HZ);
      pcf8574Available = i2cPing(PCF8574_ADDRESS);
    }
    Serial.print("[I2C] Reinit: ");
    Serial.println(i2cReady ? "OK" : "FAIL");
    Serial.print("[I2C] PCF8574: ");
    Serial.println(pcf8574Available ? "OK" : "FAIL");
    enviarBLE(String("I2C:PIN_TEST:") + (i2cReady ? "OK" : "FAIL"));
    return;
  }

  if (cmd == "PCF8574_PING") {
    bool ok = i2cPing(static_cast<uint8_t>(PCF8574_ADDRESS));
    Serial.print("[PCF8574] Ping 0x");
    Serial.print(PCF8574_ADDRESS, HEX);
    Serial.print(": ");
    Serial.println(ok ? "OK" : "FAIL");
    enviarBLE(String("PCF8574:PING:") + (ok ? "OK" : "FAIL"));
    return;
  }

  if (cmd == "PCF8574_TEST") {
    bool ok1 = pcf8574WriteByte(static_cast<uint8_t>(PCF8574_ADDRESS), 0xFF);
    delay(10);
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    Serial.print("[PCF8574] Test 0x");
    Serial.print(PCF8574_ADDRESS, HEX);
    Serial.print(": ");
    Serial.println((ok1 && okRead) ? "OK" : "FAIL");
    Serial.print("[PCF8574] IN=0x");
    Serial.println(in, HEX);
    enviarBLE(String("PCF8574:TEST:") + ((ok1 && okRead) ? "OK" : "FAIL"));
    return;
  }

  if (cmd == "PCF8574_BTNS") {
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    Serial.print("[PCF8574] IN=0x");
    Serial.println(in, HEX);
    if (!okRead) {
      Serial.println("[PCF8574] READ FAIL");
      return;
    }
    Serial.print("P0(M1)="); Serial.println((in & (1U << 0)) ? "1" : "0");
    Serial.print("P1(SE)="); Serial.println((in & (1U << 1)) ? "1" : "0");
    Serial.print("P2(PT)="); Serial.println((in & (1U << 2)) ? "1" : "0");
    Serial.print("P3(VZ)="); Serial.println((in & (1U << 3)) ? "1" : "0");
    Serial.print("P4(DP)="); Serial.println((in & (1U << 4)) ? "1" : "0");
    Serial.print("P5(SP)="); Serial.println((in & (1U << 5)) ? "1" : "0");
    Serial.print("P6(DE)="); Serial.println((in & (1U << 6)) ? "1" : "0");
    Serial.print("P7(DA)="); Serial.println((in & (1U << 7)) ? "1" : "0");
    return;
  }

  if (cmd == "GPIO_BTNS") {
    Serial.print("SA(GPIO");
    Serial.print(SA);
    Serial.print(")=");
    Serial.println(digitalRead(SA) == HIGH ? "1" : "0");
    Serial.print("GAVETA(GPIO");
    Serial.print(GAVETA);
    Serial.print(")=");
    if (GAVETA >= 0) {
      Serial.println(digitalRead(GAVETA) == HIGH ? "1" : "0");
    } else {
      Serial.println("NA");
    }
    Serial.print("RF(GPIO");
    Serial.print(RF);
    Serial.print(")=");
    Serial.println(digitalRead(RF) == HIGH ? "1" : "0");
    return;
  }

  if (cmd.startsWith("GAVETA_PIN=") || cmd.startsWith("GAVETA_PIN:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    int newPin = cmd.substring(sep + 1).toInt();
    GAVETA = newPin;
    if (GAVETA >= 0) {
      pinMode(GAVETA, INPUT_PULLUP);
      lastButtonState_GAVETA = digitalRead(GAVETA);
      saveGavetaPinPreference();
      Serial.print("[GAVETA] PIN=");
      Serial.println(GAVETA);
    } else {
      Serial.println("[GAVETA] DESABILITADO");
    }
    return;
  }

  if (cmd.startsWith("USER_ID=") || cmd.startsWith("USER_ID:")) {
    int sep = cmd.indexOf('=');
    if (sep < 0) sep = cmd.indexOf(':');
    supabaseUserId = cmd.substring(sep + 1);
    supabaseUserId.trim();
    preferences.begin("cadeira", false);
    preferences.putString("user_id", supabaseUserId);
    preferences.end();
    enviarBLE("USER_ID:OK");
    Serial.print("[USER_ID] ");
    Serial.println(supabaseUserId);
    supabaseLogUsage("USER_ID_SET");
    return;
  }
  if (cmd == "USER_ID_STATUS") {
    enviarBLE("USER_ID:" + supabaseUserId);
    return;
  }

  if (cmd.startsWith("SUPABASE_URL=") || cmd.startsWith("SUPABASE_URL:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    supabaseUrl = cmdRaw.substring(sep + 1);
    supabaseUrl.trim();
    Preferences p;
    if (p.begin("supabase", false)) {
      p.putString("url", supabaseUrl);
      p.end();
    }
    enviarBLE("SUPABASE_URL:OK");
    return;
  }
  if (cmd.startsWith("SUPABASE_KEY=") || cmd.startsWith("SUPABASE_KEY:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    supabaseKey = cmdRaw.substring(sep + 1);
    supabaseKey.trim();
    Preferences p;
    if (p.begin("supabase", false)) {
      p.putString("key", supabaseKey);
      p.end();
    }
    enviarBLE("SUPABASE_KEY:OK");
    return;
  }
  if (cmd == "SUPABASE_STATUS") {
    enviarBLE(String("SUPABASE:URL:") + (supabaseUrl.length() ? supabaseUrl : "NA") + ":KEY_SET:" + (supabaseKey.length() ? "1" : "0"));
    return;
  }

  if (cmd.startsWith("MQTT_HOST=") || cmd.startsWith("MQTT_HOST:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttHost = cmdRaw.substring(sep + 1);
    mqttHost.trim();
    saveMqttPreferences();
    applyMqttRuntimeConfig();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_HOST:OK");
    return;
  }
  if (cmd.startsWith("MQTT_PORT=") || cmd.startsWith("MQTT_PORT:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttPort = static_cast<uint16_t>(cmdRaw.substring(sep + 1).toInt());
    saveMqttPreferences();
    applyMqttRuntimeConfig();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_PORT:OK");
    return;
  }
  if (cmd.startsWith("MQTT_TLS=") || cmd.startsWith("MQTT_TLS:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    bool newTls = (cmdRaw.substring(sep + 1).toInt() != 0);
    if (newTls != mqttUseTls) {
      if (newTls && mqttPort == 1883) mqttPort = 8883;
      if (!newTls && mqttPort == 8883) mqttPort = 1883;
    }
    mqttUseTls = newTls;
    saveMqttPreferences();
    applyMqttRuntimeConfig();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_TLS:OK");
    return;
  }
  if (cmd.startsWith("MQTT_USER=") || cmd.startsWith("MQTT_USER:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttUser = cmdRaw.substring(sep + 1);
    mqttUser.trim();
    saveMqttPreferences();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_USER:OK");
    return;
  }
  if (cmd.startsWith("MQTT_PASS=") || cmd.startsWith("MQTT_PASS:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttPass = cmdRaw.substring(sep + 1);
    mqttPass.trim();
    saveMqttPreferences();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_PASS:OK");
    return;
  }
  if (cmd.startsWith("MQTT_CLIENT_ID=") || cmd.startsWith("MQTT_CLIENT_ID:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttClientId = cmdRaw.substring(sep + 1);
    mqttClientId.trim();
    saveMqttPreferences();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_CLIENT_ID:OK");
    return;
  }
  if (cmd.startsWith("MQTT_CLEAN=") || cmd.startsWith("MQTT_CLEAN:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttCleanSession = (cmdRaw.substring(sep + 1).toInt() != 0);
    saveMqttPreferences();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_CLEAN:OK");
    return;
  }
  if (cmd == "MQTT_STATUS") {
    Serial.print("[MQTT] HOST=");
    Serial.print(mqttHost);
    Serial.print(" PORT=");
    Serial.print(mqttPort);
    Serial.print(" TLS=");
    Serial.print(mqttUseTls ? "1" : "0");
    Serial.print(" CLIENT_ID=");
    Serial.print(mqttClientId.length() > 0 ? mqttClientId : ("ESP32-" + NUMERO_SERIE_CADEIRA));
    Serial.print(" CLEAN=");
    Serial.print(mqttCleanSession ? "1" : "0");
    Serial.print(" USER=");
    Serial.print(mqttUser.length() > 0 ? mqttUser : "(vazio)");
    Serial.print(" PASS=");
    Serial.println(mqttPass.length() > 0 ? "SET" : "(vazio)");
    enviarBLE("MQTT:OK");
    return;
  }
  if (cmd == "MQTT_RESET") {
    bool locked = mqttLockMs(200);
    if (!locked) {
      enviarBLE("MQTT_BUSY");
      return;
    }
    mqttHost = "broker.emqx.io";
    mqttPort = 8883;
    mqttUser = "";
    mqttPass = "";
    mqttUseTls = true;
    mqttClientId = "";
    mqttCleanSession = true;
    Preferences p;
    if (p.begin("mqtt", false)) {
      p.clear();
      p.end();
    }
    applyMqttRuntimeConfig();
    mqttClient.disconnect();
    mqttUnlock();
    beepNetMqttOkDone = false;
    enviarBLE("MQTT_RESET:OK");
    return;
  }

  if (cmd == "TLS_TEST") {
    Serial.println("====================================");
    Serial.println("             TLS_TEST               ");
    Serial.println("====================================");
    bool ok8883 = tlsHandshakeOnce(mqttHost, 8883);
    bool ok8886 = tlsHandshakeOnce(mqttHost, 8886);
    bool okCurrent = tlsHandshakeOnce(mqttHost, mqttPort);
    enviarBLE(String("TLS_TEST:HOST:") + mqttHost + ":8883:" + (ok8883 ? "OK" : "FAIL") + ":8886:" + (ok8886 ? "OK" : "FAIL") + ":CUR:" + String(mqttPort) + ":" + (okCurrent ? "OK" : "FAIL"));
    return;
  }

  if (cmd == "MQTT_RAW_TEST") {
    Serial.println("====================================");
    Serial.println("           MQTT_RAW_TEST            ");
    Serial.println("====================================");
    bool prevEnabled = mqttConnectEnabled;
    mqttConnectEnabled = false;
    if (mqttLockMs(200)) {
      mqttClient.disconnect();
      mqttUnlock();
    }
    delay(200);
    String cid = mqttClientId.length() > 0 ? mqttClientId : ("ESP32-" + NUMERO_SERIE_CADEIRA);
    bool ok8883 = mqttRawConnackOnce(mqttHost, 8883, cid);
    bool ok8886 = mqttRawConnackOnce(mqttHost, 8886, cid);
    bool okCurrent = mqttRawConnackOnce(mqttHost, mqttPort, cid);
    mqttConnectEnabled = prevEnabled;
    enviarBLE(String("MQTT_RAW_TEST:HOST:") + mqttHost + ":8883:" + (ok8883 ? "OK" : "FAIL") + ":8886:" + (ok8886 ? "OK" : "FAIL") + ":CUR:" + String(mqttPort) + ":" + (okCurrent ? "OK" : "FAIL"));
    return;
  }

  if (cmd == "LIMITS_OFF") {
    ignoreLimitLocks = true;
    ignoreGavetaLock = true;
    Serial.println("[LIMIT] LIMITS_OFF");
    enviarBLE("LIMITS:OFF");
    return;
  }

