joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
  if (cmd == "LIMITS_ON") {
    ignoreLimitLocks = false;
    ignoreGavetaLock = false;
    Serial.println("[LIMIT] LIMITS_ON");
    enviarBLE("LIMITS:ON");
    return;
  }

  if (cmd == "LIMITS_STATUS") {
    Serial.print("[LIMIT] IGNORE=");
    Serial.println(ignoreLimitLocks ? "1" : "0");
    enviarBLE(String("LIMITS:IGNORE:") + (ignoreLimitLocks ? "1" : "0") + ":GAVETA_IGNORE:" + (ignoreGavetaLock ? "1" : "0"));
    return;
  }

  if (cmd == "OTA_ON") {
    otaEnabled = true;
    otaSavePreferences();
    enviarBLE("OTA:ON");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_ON", false);
    mqttStatusDirty = true;
    return;
  }
  if (cmd == "OTA_OFF") {
    otaEnabled = false;
    otaSavePreferences();
    enviarBLE("OTA:OFF");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_OFF", false);
    mqttStatusDirty = true;
    return;
  }
  if (cmd == "OTA_STATUS") {
    enviarBLE(String("OTA:ENABLED:") + (otaEnabled ? "1" : "0") + ":INTERVAL:" + String(otaIntervalSec) + ":PENDING:" + (otaPendingVersion.length() ? otaPendingVersion : "NA") + ":MANIFEST:" + (otaManifestUrl.length() ? otaManifestUrl : "NA"));
    return;
  }
  if (cmd.startsWith("OTA_MANIFEST=") || cmd.startsWith("OTA_MANIFEST:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    otaManifestUrl = cmdRaw.substring(sep + 1);
    otaManifestUrl.trim();
    otaSavePreferences();
    enviarBLE("OTA_MANIFEST:OK");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_MANIFEST_SET", false);
    return;
  }
  if (cmd.startsWith("OTA_INTERVAL=") || cmd.startsWith("OTA_INTERVAL:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    uint32_t sec = static_cast<uint32_t>(cmdRaw.substring(sep + 1).toInt());
    if (sec < 60) sec = 60;
    otaIntervalSec = sec;
    otaSavePreferences();
    enviarBLE("OTA_INTERVAL:OK");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "OTA_INTERVAL_SET", false);
    return;
  }
  if (cmd == "OTA_CHECK") {
    OtaInfo info;
    bool ok = otaFetchManifest(info);
    if (!ok) {
      enviarBLE("OTA:CHECK:FAIL");
      return;
    }
    if (!info.available) {
      enviarBLE("OTA:NO_UPDATE");
      return;
    }
    enviarBLE("OTA:UPDATE:" + info.version);
    otaDownloadAndUpdate(info);
    return;
  }
  if (cmd.startsWith("OTA_APPLY=") || cmd.startsWith("OTA_APPLY:")) {
    int sep = cmdRaw.indexOf('=');
    if (sep < 0) sep = cmdRaw.indexOf(':');
    String url = cmdRaw.substring(sep + 1);
    url.trim();
    OtaInfo info;
    info.available = true;
    info.mandatory = true;
    info.version = "MANUAL";
    info.url = url;
    info.md5 = "";
    info.size = 0;
    enviarBLE("OTA:APPLY");
    otaDownloadAndUpdate(info);
    return;
  }

  if (cmd == "BUZZER_TEST_ON") {
    buzzerTestEnabled = true;
    Serial.println("[BUZZER] TEST_ON");
    return;
  }
  if (cmd == "BUZZER_TEST_OFF") {
    buzzerTestEnabled = false;
    Serial.println("[BUZZER] TEST_OFF");
    return;
  }
  if (cmd == "BUZZER_TEST_STATUS") {
    Serial.print("[BUZZER] TEST=");
    Serial.println(buzzerTestEnabled ? "ON" : "OFF");
    return;
  }

  if (cmd == "TEST_SA") { setOutputPin(Rele_SA, true, "TEST"); delay(500); setOutputPin(Rele_SA, false, "TEST"); return; }
  if (cmd == "TEST_DA") { setOutputPin(Rele_DA, true, "TEST"); delay(500); setOutputPin(Rele_DA, false, "TEST"); return; }
  if (cmd == "TEST_SE") { setOutputPin(Rele_SE, true, "TEST"); delay(500); setOutputPin(Rele_SE, false, "TEST"); return; }
  if (cmd == "TEST_DE") { setOutputPin(Rele_DE, true, "TEST"); delay(500); setOutputPin(Rele_DE, false, "TEST"); return; }
  if (cmd == "TEST_SP") { setOutputPin(Rele_SP, true, "TEST"); delay(500); setOutputPin(Rele_SP, false, "TEST"); return; }
  if (cmd == "TEST_DP") { setOutputPin(Rele_DP, true, "TEST"); delay(500); setOutputPin(Rele_DP, false, "TEST"); return; }
  if (cmd == "TEST_RF") { setOutputPin(Rele_refletor, true, "TEST"); delay(500); setOutputPin(Rele_refletor, false, "TEST"); return; }

  if (cmd == "PCF8574_INT") {
    Serial.print("[PCF8574] INT_PIN=");
    Serial.print(PCF8574_INT_PIN);
    Serial.print(" LEVEL=");
    if (PCF8574_INT_PIN >= 0) {
      Serial.println(digitalRead(static_cast<uint8_t>(PCF8574_INT_PIN)) == HIGH ? "1" : "0");
    } else {
      Serial.println("NA");
    }
    Serial.print("[PCF8574] INT_COUNT=");
    Serial.println(static_cast<uint32_t>(pcf8574InterruptCount));
    Serial.print("[PCF8574] INT_PENDING=");
    Serial.println(pcf8574InterruptPending ? "1" : "0");
    bool okRead = false;
    uint8_t in = pcf8574ReadByte(static_cast<uint8_t>(PCF8574_ADDRESS), &okRead);
    Serial.print("[PCF8574] IN=0x");
    Serial.println(in, HEX);
    if (pcf8574InterruptPending) {
      pcf8574InterruptPending = false;
    }
    return;
  }

  // ===== COMANDOS WIFI (funcionam mesmo com cadeira bloqueada) =====
  if (cmd == "WIFI_RESET") {
    enviarBLE("WIFI:RESETTING");
    resetaConfiguracoesWifi();
    return;
  }
  
  if (cmd == "WIFI_STATUS") {
    if (WiFi.status() == WL_CONNECTED) {
      enviarBLE("WIFI:CONNECTED:" + WiFi.SSID());
    } else {
      enviarBLE("WIFI:DISCONNECTED");
    }
    return;
  }
  
  if (cmd == "WIFI_IP") {
    if (WiFi.status() == WL_CONNECTED) {
      enviarBLE("WIFI_IP:" + WiFi.localIP().toString());
    } else {
      enviarBLE("WIFI_IP:NONE");
    }
    return;
  }

  if (cmd == "TREND_TEST") {
    if (Rele_TREND_SOBE < 0 && Rele_TREND_DESCE < 0) {
      enviarBLE("TREND_TEST:NA");
      return;
    }
    enviarBLE("TREND_TEST:START");
    mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "TREND_TEST", false);

    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "TREND_TEST");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "TREND_TEST");
    estado_trend_sobe = false;
    estado_trend_desce = false;
    mqttStatusDirty = true;
    delay(200);

    if (Rele_TREND_SOBE >= 0) {
      estado_trend_sobe = true;
      ultimoComandoTrendSobe = millis();
      setOutputPin(Rele_TREND_SOBE, true, "TREND_TEST");
      mqttStatusDirty = true;
      delay(800);
      setOutputPin(Rele_TREND_SOBE, false, "TREND_TEST");
      estado_trend_sobe = false;
      mqttStatusDirty = true;
      delay(200);
    }

    if (Rele_TREND_DESCE >= 0) {
      estado_trend_desce = true;
      ultimoComandoTrendDesce = millis();
      setOutputPin(Rele_TREND_DESCE, true, "TREND_TEST");
      mqttStatusDirty = true;
      delay(800);
      setOutputPin(Rele_TREND_DESCE, false, "TREND_TEST");
      estado_trend_desce = false;
      mqttStatusDirty = true;
      delay(200);
    }

