joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
void atualizaHorimetro() {
  // Verifica se algum motor está ligado (HIGH = ligado)
  bool algumMotorLigado = (digitalRead(Rele_SA) == HIGH) || (digitalRead(Rele_DA) == HIGH) ||
                          (digitalRead(Rele_SE) == HIGH) || (digitalRead(Rele_DE) == HIGH) ||
                          (digitalRead(Rele_SP) == HIGH) || releLigado(Rele_DP) ||
                          (Rele_TREND_SOBE >= 0 && digitalRead(Rele_TREND_SOBE) == HIGH) ||
                          (Rele_TREND_DESCE >= 0 && digitalRead(Rele_TREND_DESCE) == HIGH);
  
  if (algumMotorLigado && !motorLigado) {
    iniciaTimerMotor();
  } else if (!algumMotorLigado && motorLigado) {
    paraTimerMotor();
  }
}

void salvaHorimetro() {
  preferences.begin("horimetro", false);
  preferences.putFloat("hours", horimetro);
  preferences.putULong("millis", totalMillisMotor);
  preferences.end();
}

void carregaHorimetro() {
  preferences.begin("horimetro", false);
  horimetro = preferences.getFloat("hours", 0);
  totalMillisMotor = preferences.getULong("millis", 0);
  preferences.end();
  
  Serial.print("Horimetro carregado: ");
  Serial.print(horimetro);
  Serial.println(" horas");
}

// ========== SUPABASE ==========
void atualizaSupabase() {
  if (millis() - ultimaAtualizacaoSupabase < INTERVALO_ATUALIZACAO_SUPABASE) return;
  if (WiFi.status() != WL_CONNECTED) return;
  
  ultimaAtualizacaoSupabase = millis();
  enviaHorimetroParaSupabase();
}

void verificacaoPeriodicaStatus() {
  if (millis() - ultimaVerificacaoStatus < INTERVALO_VERIFICACAO_STATUS) return;
  ultimaVerificacaoStatus = millis();
  
  // Pula a primeira verificação de status (não na primeira conexão do dia)
  if (primeiraVerificacaoStatus) {
    primeiraVerificacaoStatus = false;
    return;
  }
  
  if (WiFi.status() == WL_CONNECTED) {
    verificaStatusCadeira();
  }
}

void enviaHorimetroParaSupabase() {
  if (WiFi.status() != WL_CONNECTED) return;
  
  // Verifica se hÃ¡ memÃ³ria suficiente antes de tentar SSL
  if (ESP.getFreeHeap() < 30000) {
    Serial.println("[AVISO] Memoria insuficiente para SSL, pulando envio.");
    return;
  }
  
  Serial.println("Iniciando envio de horimetro...");
  
  Serial.print("[DEBUG] Heap livre: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  WiFiClientSecure client;
  client.setInsecure();
  
  HTTPClient http;
  String url = supabaseUrl + "/rest/v1/chairs?serial_number=eq." + NUMERO_SERIE_CADEIRA;
  
  if (http.begin(client, url)) {
    http.setTimeout(10000); // 10s timeout
    http.addHeader("Content-Type", "application/json");
    if (supabaseKey.length() > 0) {
      http.addHeader("apikey", supabaseKey);
      http.addHeader("Authorization", String("Bearer ") + supabaseKey);
    }
    http.addHeader("Prefer", "return=minimal");
    
    StaticJsonDocument<256> doc;
    doc["hour_meter"] = horimetro;
    doc["last_update"] = getTimestamp();
    
    String payload;
    serializeJson(doc, payload);
    
    Serial.println("[DEBUG] Payload PATCH: " + payload);
    
    int httpCode = http.PATCH(payload);
    
    Serial.print("[DEBUG] HTTP Code: ");
    Serial.println(httpCode);
    
    if (httpCode == 200 || httpCode == 204) {
      Serial.println("[OK] Horimetro enviado ao Supabase");
    } else if (httpCode == 404) {
      Serial.println("Cadeira nao encontrada (404), registrando...");
      registraCadeiraNoSupabase();
    } else if (httpCode > 0) {
      Serial.print("[ERRO] Supabase (PATCH): ");
      Serial.print(httpCode);
      Serial.print(" - Resposta: ");
      Serial.println(http.getString());
    } else {
      Serial.print("[ERRO] Conexao (PATCH): ");
      Serial.print(httpCode);
      Serial.print(" - ");
      Serial.println(http.errorToString(httpCode).c_str());
    }
    http.end();
  } else {
    Serial.println("Falha ao iniciar conexao HTTP para PATCH");
  }
}

void registraCadeiraNoSupabase() {
  if (WiFi.status() != WL_CONNECTED) return;
  
  // Verifica se hÃ¡ memÃ³ria suficiente antes de tentar SSL
  if (ESP.getFreeHeap() < 30000) {
    Serial.println("[AVISO] Memoria insuficiente para SSL, pulando registro.");
    return;
  }
  
  Serial.println("Registrando cadeira no Supabase...");
  WiFiClientSecure client;
  client.setInsecure();
  
  HTTPClient http;
  String url = supabaseUrl + "/rest/v1/chairs";
  
  if (http.begin(client, url)) {
    http.setTimeout(10000); // 10s timeout
    http.addHeader("Content-Type", "application/json");
    if (supabaseKey.length() > 0) {
      http.addHeader("apikey", supabaseKey);
      http.addHeader("Authorization", String("Bearer ") + supabaseKey);
    }
    http.addHeader("Prefer", "return=minimal");
    
    StaticJsonDocument<512> doc;
    doc["serial_number"] = NUMERO_SERIE_CADEIRA;
    doc["hour_meter"] = horimetro;
    doc["enabled"] = true;
    doc["maintenance_required"] = false;
    doc["maintenance_hours"] = 500;
    
    String timestamp = getTimestamp();
    if (timestamp != "null") {
      doc["created_at"] = timestamp;
      doc["last_update"] = timestamp;
    }
    
    String payload;
    serializeJson(doc, payload);
    Serial.println("[REGISTRO] Payload: " + payload);
    Serial.println("[REGISTRO] Enviando POST...");
    
    int httpCode = http.POST(payload);
    
    Serial.print("[REGISTRO] HTTP Code: ");
    Serial.println(httpCode);
    
    if (httpCode == 201) {
      Serial.println("[SUCESSO] Cadeira registrada!");
      supabaseLogUsage("CHAIR_REGISTERED");
    } else if (httpCode == 409) {
      Serial.println("[INFO] Cadeira ja registrada (409)");
    } else if (httpCode > 0) {
      Serial.print("[ERRO] POST falhou: ");
      Serial.print(httpCode);
      Serial.print(" - Resposta: ");
      Serial.println(http.getString());
    } else {
      Serial.print("[ERRO] Conexao falhou: ");
      Serial.println(http.errorToString(httpCode).c_str());
    }
    http.end();
  } else {
    Serial.println("Falha ao iniciar conexao HTTP para POST");
  }
}

static bool supabasePostJson(const String& restPath, const String& payload) {
  if (WiFi.status() != WL_CONNECTED) return false;
  if (ESP.getFreeHeap() < 30000) return false;

  WiFiClientSecure client;
  client.setInsecure();

  HTTPClient http;
  String url = supabaseUrl + restPath;
  if (!http.begin(client, url)) {
    return false;
  }

  http.setTimeout(10000);
  http.addHeader("Content-Type", "application/json");
  if (supabaseKey.length() > 0) {
    http.addHeader("apikey", supabaseKey);
    http.addHeader("Authorization", String("Bearer ") + supabaseKey);
  }
  http.addHeader("Prefer", "return=minimal");

