joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
      Serial.println("Memoria 1 concluida");
      return;
    }
  }
}

// ========== FUNÃ‡Ã•ES DO ENCODER VIRTUAL ==========
void contagem_tempo_incoder_virtual() {
  bool dir_encosto_up = (digitalRead(Rele_DE) == HIGH);
  bool dir_encosto_down = (digitalRead(Rele_SE) == HIGH);
  bool dir_asento_up = (digitalRead(Rele_SA) == HIGH);
  bool dir_asento_down = (digitalRead(Rele_DA) == HIGH);
  bool dir_perneira_up = (digitalRead(Rele_SP) == HIGH);
  bool dir_perneira_down = releLigado(Rele_DP);

  uint32_t d_encosto = pulses_encosto - last_pulses_encosto;
  uint32_t d_asento = pulses_assento - last_pulses_assento;
  uint32_t d_perneira = pulses_perneira - last_pulses_perneira;
  uint32_t d_trend = pulses_trend - last_pulses_trend_travel;
  last_pulses_encosto = pulses_encosto;
  last_pulses_assento = pulses_assento;
  last_pulses_perneira = pulses_perneira;
  last_pulses_trend_travel = pulses_trend;

  if (d_encosto) {
    motorTravelPulsesEncosto += d_encosto;
    motorTravelUnsavedEncosto += d_encosto;
  }
  if (d_asento) {
    motorTravelPulsesAssento += d_asento;
    motorTravelUnsavedAssento += d_asento;
  }
  if (d_perneira) {
    motorTravelPulsesPerneira += d_perneira;
    motorTravelUnsavedPerneira += d_perneira;
  }
  if (d_trend) {
    motorTravelPulsesTrend += d_trend;
    motorTravelUnsavedTrend += d_trend;
  }
  if (encoderPulseDebug && (d_encosto || d_asento || d_perneira || d_trend)) {
    Serial.print("[ENC_PULSE] dENC=");
    Serial.print(d_encosto);
    Serial.print(" dASS=");
    Serial.print(d_asento);
    Serial.print(" dPER=");
    Serial.print(d_perneira);
    Serial.print(" dTRE=");
    Serial.print(d_trend);
    Serial.print(" | PENC=");
    Serial.print(static_cast<uint32_t>(pulses_encosto));
    Serial.print(" PASS=");
    Serial.print(static_cast<uint32_t>(pulses_assento));
    Serial.print(" PPER=");
    Serial.print(static_cast<uint32_t>(pulses_perneira));
    Serial.print(" PTRE=");
    Serial.println(static_cast<uint32_t>(pulses_trend));
  }
  saveMotorTravelPreferences(false);

  if (d_encosto) {
    if (dir_encosto_up) {
      if (calibrationInProgress || incoder_virtual_encosto_service + (int)d_encosto <= fim_encosto_encoder) {
        incoder_virtual_encosto_service += (int)d_encosto;
        trava_bt_SE = false;
      } else {
        incoder_virtual_encosto_service = fim_encosto_encoder;
        setOutputPin(Rele_DE, false, "LIMIT");
        trava_bt_DE = true;
      }
    } else if (dir_encosto_down) {
      if (incoder_virtual_encosto_service - (int)d_encosto >= 0) {
        incoder_virtual_encosto_service -= (int)d_encosto;
        trava_bt_DE = false;
      } else {
        incoder_virtual_encosto_service = 0;
        setOutputPin(Rele_SE, false, "LIMIT");
        trava_bt_SE = true;
      }
    }
  }

  if (d_asento) {
    if (dir_asento_up) {
      if (calibrationInProgress || incoder_virtual_asento_service + (int)d_asento <= fim_asento_encoder) {
        incoder_virtual_asento_service += (int)d_asento;
        trava_bt_DA = false; trava_bt_SA = false;
      } else {
        incoder_virtual_asento_service = fim_asento_encoder;
        setOutputPin(Rele_SA, false, "LIMIT");
        trava_bt_SA = true;
      }
    } else if (dir_asento_down) {
      if (incoder_virtual_asento_service - (int)d_asento >= 0) {
        incoder_virtual_asento_service -= (int)d_asento;
        trava_bt_SA = false; trava_bt_DA = false;
      } else {
        incoder_virtual_asento_service = 0;
        setOutputPin(Rele_DA, false, "LIMIT");
        trava_bt_DA = true;
      }
    }
  }

  if (d_perneira) {
    if (dir_perneira_up) {
      if (calibrationInProgress || incoder_virtual_perneira_service + (int)d_perneira <= fim_perneira_encoder) {
        incoder_virtual_perneira_service += (int)d_perneira;
        trava_bt_DP = false; trava_bt_SP = false;
      } else {
        incoder_virtual_perneira_service = fim_perneira_encoder;
        setOutputPin(Rele_SP, false, "LIMIT");
        trava_bt_SP = true;
      }
    } else if (dir_perneira_down) {
      if (incoder_virtual_perneira_service - (int)d_perneira >= 0) {
        incoder_virtual_perneira_service -= (int)d_perneira;
        trava_bt_SP = false; trava_bt_DP = false;
      } else {
        incoder_virtual_perneira_service = 0;
        setOutputPin(Rele_DP, false, "LIMIT");
        trava_bt_DP = true;
      }
    }
  }
}

// ========== WATCH DOG (LED heartbeat) ==========
void Watch_Dog() {
  unsigned long agora = millis();
  if (agora - ultimoMillisPiscaLed > 500) {
    ultimoMillisPiscaLed = agora;
    estadoLedPisca = !estadoLedPisca;
    digitalWrite(LED, estadoLedPisca ? HIGH : LOW);
  }
}

unsigned long inicioAtivacaoRele = 0;
const unsigned long TIMEOUT_RELE = 30000; // 30 segundos

// ========== MONITORAMENTO DE TEMPO DOS RELÃ‰S (seguranÃ§a) ==========
void monitora_tempo_rele() {
  if (isGavetaAberta()) {
    bool spOn = (digitalRead(Rele_SP) == HIGH);
    bool dpOn = releLigado(Rele_DP);
    if (spOn || dpOn) {
      Serial.println("[GAVETA] Aberta - desligando perneira");
      setOutputPin(Rele_SP, false, "GAVETA");
      setOutputPin(Rele_DP, false, "GAVETA");
      estado_sp = false;
      estado_dp = false;
      enviarBLE("GAVETA:OPEN");
      enviarBLE("SP:GAVETA");
      enviarBLE("DP:GAVETA");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
    }
  }

  bool algumReleAtivo = (digitalRead(Rele_SE) == HIGH || 
                         digitalRead(Rele_SA) == HIGH || 
                         digitalRead(Rele_DA) == HIGH || 
                         digitalRead(Rele_SP) == HIGH || 
                         releLigado(Rele_DP) || 
                         digitalRead(Rele_DE) == HIGH ||
                         (Rele_TREND_SOBE >= 0 && digitalRead(Rele_TREND_SOBE) == HIGH) ||
                         (Rele_TREND_DESCE >= 0 && digitalRead(Rele_TREND_DESCE) == HIGH));

  if (algumReleAtivo) {
    if (inicioAtivacaoRele == 0) {
      inicioAtivacaoRele = millis();
    } else if (millis() - inicioAtivacaoRele >= TIMEOUT_RELE) {
      Serial.print("!!! TIMEOUT DE SEGURANCA - RELE ATIVO POR 30s:");
      if (digitalRead(Rele_SE) == HIGH) Serial.print(" SE");
      if (digitalRead(Rele_SA) == HIGH) Serial.print(" SA");
      if (digitalRead(Rele_DA) == HIGH) Serial.print(" DA");
      if (digitalRead(Rele_SP) == HIGH) Serial.print(" SP");
      if (releLigado(Rele_DP)) Serial.print(" DP");
      if (digitalRead(Rele_DE) == HIGH) Serial.print(" DE");
      if (Rele_TREND_SOBE >= 0 && digitalRead(Rele_TREND_SOBE) == HIGH) Serial.print(" TREND_SOBE");
      if (Rele_TREND_DESCE >= 0 && digitalRead(Rele_TREND_DESCE) == HIGH) Serial.print(" TREND_DESCE");
      Serial.println(" !!!");
      desligaTodosReles("TIMEOUT");
      inicioAtivacaoRele = 0;
    }
  } else {
    inicioAtivacaoRele = 0;
  }
}

// ========== BOTÃƒO DE SEGURANÃ‡A (parada de emergÃªncia) ==========
void Button_Seg() {
  if (cont == 0 && cont13 == 0 && !faz_m1 && !vzInicialEmAndamento) {
    return;
  }
  buttonState = digitalRead(DE);
  if (buttonState == LOW) { AT_SEG(); }

