joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/arduino/esp32_bluetooth_chair_s3_single/esp32_bluetooth_chair_s3_single.ino
  while (cont == 1) {
    Watch_Dog();
    buzzerTestTick();
    delay(1);
    
    // Verifica parada via BLE
    if (comandoBLE.length() > 0) {
      String cmd = comandoBLE;
      comandoBLE = "";
      cmd.trim();
      cmd.toUpperCase();
      if (cmd == "AT_SEG" || cmd == "STOP") {
        AT_SEG();
        cont = 0;
        contador2 = 0;
        buzzerPulseStop();
        return;
      }
    }
    
    Button_geral();
    Button_Seg();
    contagem_tempo_incoder_virtual();

    if (canEarlyFinish &&
        incoder_virtual_encosto_service == 0 &&
        incoder_virtual_asento_service == 0 &&
        incoder_virtual_perneira_service == 0) {
      cont = 0;
    } else if (millis() - startTime >= VZ_MAX_TIME_MS) {
      cont = 0;
    }
  }

  setOutputPin(Rele_DA, false, "VZ");
  setOutputPin(Rele_SE, false, "VZ");
  setOutputPin(Rele_DP, false, "VZ");

  uint32_t dEnc = pulses_encosto - startPulseEnc;
  uint32_t dAss = pulses_assento - startPulseAss;
  uint32_t dPer = pulses_perneira - startPulsePer;
  if (checkEnc) {
    Serial.print("[VZ] PULSOS ENC=");
    Serial.print(dEnc);
    Serial.print(" ASS=");
    Serial.print(dAss);
    Serial.print(" PER=");
    Serial.println(dPer);
    if (dEnc == 0) Serial.println("[ERRO ENC] Encosto sem pulso no VZ");
    if (dAss == 0) Serial.println("[ERRO ENC] Assento sem pulso no VZ");
    if (dPer == 0) Serial.println("[ERRO ENC] Perneira sem pulso no VZ");
  }

  bip();
  buzzerPulseStop();
  faz_bt_seg = 0;
  Serial.println("Fim VZ");
  enviarBLE("VZ:DONE");
  supabaseLogUsage("VZ_DONE");
  incoder_virtual_encosto_service = 0;
  incoder_virtual_asento_service = 0;
  incoder_virtual_perneira_service = 0;
}

// ========== EXECUÃ‡ÃƒO DA POSIÃ‡ÃƒO INICIAL VZ ==========
void executa_vz_ini() {
  Serial.println("====================================");
  Serial.println("  VZ INICIAL - " + NUMERO_SERIE_CADEIRA);
  Serial.println("====================================");
  Serial.println("Executando VZ inicial - Ativando reles sequencialmente");
  Serial.println("[INFO] Bloqueando loop() durante VZ inicial...");
  buzzerPulseStart2s();
  vzInicialEmAndamento = true; // Bloqueia loop() completamente
  
  Serial.println("[INFO] Desabilitando controle de encoder virtual temporariamente...");
  bool checkEnc = (fim_encosto_encoder == 0 && fim_asento_encoder == 0 && fim_perneira_encoder == 0);
  habilitaEncoderVirtual = checkEnc;
  Serial.print("[VZ_INI] ENC_CHECK=");
  Serial.println(checkEnc ? "1" : "0");
  uint32_t startPulseEnc = pulses_encosto;
  uint32_t startPulseAss = pulses_assento;
  uint32_t startPulsePer = pulses_perneira;
  int startEncPos = incoder_virtual_encosto_service;
  int startAssPos = incoder_virtual_asento_service;
  int startPerPos = incoder_virtual_perneira_service;
  bool canEarlyFinish = (startEncPos != 0 || startAssPos != 0 || startPerPos != 0);

  Serial.println("Ativando Rele_DA...");
  setOutputPin(Rele_DA, true, "VZ_INI");
  delay(500);
  
  Serial.println("Ativando Rele_SE...");
  setOutputPin(Rele_SE, true, "VZ_INI");
  delay(500);
  
  Serial.println("Ativando Rele_DP...");
  setOutputPin(Rele_DP, true, "VZ_INI");
  delay(500);

  Serial.print("Aguardando ");
  Serial.print(VZ_MAX_TIME_MS);
  Serial.println(" ms...");
  Serial.println("[DEBUG] Heap livre: " + String(ESP.getFreeHeap()) + " bytes");
  Serial.println("[DEBUG] Iniciando loop com feed do watchdog...");
  Serial.flush();
  
  unsigned long startTime = millis();
  int lastSecond = 0;
  while (millis() - startTime < VZ_MAX_TIME_MS) {
    yield();  // Alimenta watchdog continuamente
    Watch_Dog();
    buzzerTestTick();
    if (checkEnc) {
      contagem_tempo_incoder_virtual();
    }
    if (canEarlyFinish &&
        incoder_virtual_encosto_service == 0 &&
        incoder_virtual_asento_service == 0 &&
        incoder_virtual_perneira_service == 0) {
      break;
    }
    int currentSecond = (millis() - startTime) / 1000;
    if (currentSecond > lastSecond) {
      Serial.printf("[%d] ", currentSecond);
      Serial.flush();
      lastSecond = currentSecond;
    }
    delay(100);  // Delay pequeno para não travar CPU
  }
  
  Serial.println("\n[DEBUG] Loop completo!");
  Serial.flush();
  
  Serial.println("\nVZ inicial concluido.");
  Serial.println("Desligando reles do VZ inicial...");
  setOutputPin(Rele_DA, false, "VZ_INI");
  setOutputPin(Rele_SE, false, "VZ_INI");
  setOutputPin(Rele_DP, false, "VZ_INI");

  if (checkEnc) {
    uint32_t dEnc = pulses_encosto - startPulseEnc;
    uint32_t dAss = pulses_assento - startPulseAss;
    uint32_t dPer = pulses_perneira - startPulsePer;
    Serial.print("[VZ_INI] PULSOS ENC=");
    Serial.print(dEnc);
    Serial.print(" ASS=");
    Serial.print(dAss);
    Serial.print(" PER=");
    Serial.println(dPer);
    if (dEnc == 0) Serial.println("[ERRO ENC] Encosto sem pulso no VZ_INI");
    if (dAss == 0) Serial.println("[ERRO ENC] Assento sem pulso no VZ_INI");
    if (dPer == 0) Serial.println("[ERRO ENC] Perneira sem pulso no VZ_INI");
  }

  Serial.println("Fim VZ inicial - Reles desligados");
  Serial.println("Resetando encoders virtuais...");
  incoder_virtual_encosto_service = 0;
  incoder_virtual_asento_service = 0;
  incoder_virtual_perneira_service = 0;
  Serial.println("Encoders resetados.");
  
  Serial.println("[INFO] Reabilitando controle de encoder virtual.");
  habilitaEncoderVirtual = true; // Reabilita encoder apÃ³s VZ inicial
  
  Serial.println("[INFO] Desbloqueando loop() - VZ inicial completo.");
  vzInicialEmAndamento = false; // Libera loop() para executar normalmente
  buzzerPulseStop();
}

// ========== EXECUÃ‡ÃƒO DA POSIÃ‡ÃƒO DE PARTO (PT) ==========
void executa_pt() {
  Serial.println("PT acionado");
  bip();
  buzzerPulseStart2s();

  setOutputPin(Rele_SA, true, "PT");
  delay(250);
  setOutputPin(Rele_DE, true, "PT");
  delay(250);
  setOutputPin(Rele_SP, true, "PT");

  Serial.println("Executando PT");
  faz_bt_seg = 1;

  while (cont13 == 1) {
    Watch_Dog();
    buzzerTestTick();
    delay(1);
    
    // Verifica parada via BLE
    if (comandoBLE.length() > 0) {
      String cmd = comandoBLE;
      comandoBLE = "";
      cmd.trim();
      cmd.toUpperCase();
      if (cmd == "AT_SEG" || cmd == "STOP") {
        AT_SEG();
        cont13 = 0;
        contador = 0;
        buzzerPulseStop();
        return;
      }
    }
    
    Button_geral();
    Button_Seg();
    contagem_tempo_incoder_virtual();
    contador++;

